README.org
#+TITLE: Fosshost CIC Operational Policy Statement
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: toc:nil

[[https://fosshost.org][Fosshost]] is a not-for-profit "cloud" provider.  We offer hosting at no
cost to the Free and Open Source Software projects we support.
Projects must apply for our services, as well as meeting eligibility
criteria, for example bearing a FOSS license.  As of May 1st, 2021 we
host more than 100 FOSS projects in data-centers across five continents.

This document does not become effective until approved by our
directors.  When that occurs we'll update this.

* SUMMARY
  :PROPERTIES:
  :UNNUMBERED: t
  :END:
Our team is entirely volunteers, who donate their labor.  We partner
with other organizations (our Sponsors and Partners) who provide us
with servers, rack-space, bandwidth, etc.  We use these resources to
create/provide/distribute services to our tenants (the projects we
host), with access to infrastructural technology services, for example
virtual private servers (VPS) and consoles of these.  We don't provide
remuneration/compensation to our Sponsors/Partners nor to our team,
except as specified herein as will generally state things so that:

** ITEMS
1. We don't offer monetary or other consideration to our staff including directors.
2. We may, at our option, prefer to host projects from our volunteers when we can.
3. We might well use your projects branding and otherwise generally mention if/when we host you but you can ask us not to that.
4. You can in otherwise influence our communications (if any) about our relationship if/when we partner together.
5. We can stop doing some or all of what we are doing for you at almost any time for almost any reason at our option.
6. We will keep records so that we regularly report on these and similar stated promises.
7. We will consider most of the records we keep as for internal use only.
8. We will state expressly specific information we may but do not usually report along with any and all ways that we are able to predict unavoidable/required disclosure.
9. We will fully and faithfully report such information however specific as we must to satisfy due diligence.
10. We may share more widely or otherwise such vital records as we are required to maintain and do so if/as/when we may choose.
11. We effect procedures and internal systems which keep vital records such as for the office of the regulator of the CIC.
12. Most publications at our discretion is in terms of this reporting and other information we possess remains in confidence to the extent possible for us.
13. Abuse of any kind is not tolerated and will usually cause some or all information related and kept within our other systems to become more vital.
14. We strongly prefer FOSS software and will not consider hosting other types of development or otherwise than development under a FOSS license.
15. We may, at our option, elect to use non-FOSS software but we will never incorporate it into our network or expect other than our own staff to use it.
16. Our staff give up some rights when then volunteer for us, such as to represent our directors in conducting the business of our organization & mission.
17. Our volunteers do not otherwise delegate or defer than as stated below as being typical; we in no way consider these lessen our responsibility to/for FOSSHOST CIC.

** LIMITATIONS AND ALTERNATIVES

  Our articles form the sole contract between the directors.

  Notwithstanding our articles as filed with the office of the
  regulator of the UK CIC, which our policy must be consistent with
  and subject/secondary to, these and no other documents govern our
  organization including our members, agents, and/or assignees when
  acting on our behalf expect whereas our policies (this document or
  documents) specifically describe and require or allow.

  We post our articles here after we sign and file duly agree to publish them:
    <https://github.com/fosshostorg/policy/blob/main/articles.pdf>

** NOTES
As a UK registered CIC, Fosshost operates at all times under our
articles, which have been filed with the office of the UK CIC
regulator.  We are subject also to oversight, for example by that
administration, who we expect seek to ensure we demonstrate our
assets/expenditures directly benefit our community and in trust.

This document represents our process and principle work-product in
documenting our internal practices.  It has a number of goals:
 * declare the interests we serve and how we benefit our community
 * mutually protect from liability those who act in good faith
 * describe our operating practice and recognize well qualified scrutiny
 * ensure we measure our results and evolve our methods, documenting exceptions to stated preferences and practice
 * record whether we have acted as dependable custodians and with consistency and within legal and ethical bounds
 * publish (or cause us to carefully consider publishing, perhaps redacting among) our vital records

*** How To Change This Document
    NOTE: *CONSIDER APPROVAL* before you begin this process

    Approved or in-place policy and procedure may require prior
    approval from one or more specific individuals named
    later/elsewhere assumed to be a director (or the board of
    directors, in case of contention) or otherwise as stated.

    To complete all steps You will need:
    * a recent emacs (e.g. with org, [[https://github.com/emacsmirror/org/blob/master/lisp/ox-md.el][ox-md.el]], etc)

    Manual Build Steps (fosshost-org/policy):
    1) Use a text editor to alter README.org
    2) Commit your change to the public repository (you can stop after this if you don't have a working emacs)
    3) ./pre-commit && emacs --batch -l build.el
    4) ./post-commit

    Troubleshooting
    * Please don't manually update anything that's auto-generated (e.g alternative formats like md, html and ascii).
    * If things go wrong (e.g. against the public repository) please immediately revert the change; we can try again.
    * It's fine to update the ~.org~ file and then generate as much as you can (or nothing at all)
    * We can place the ~pre-~ and ~post-~ commit scrips in ~.git/hooks~, for crude and fragile local automation around build.el
    * This (usually) seems to work under windows (e.g. via "git bash" command line tools & putty for auth)
    * The post-commit script uses ~git add~; you can use this manually, for example if some formats don't generate or other build script issues.
    * Checking in the approved (or otherwise meaningful) changes to the .org file (and getting them "just right") is our priority.
    * In all cases the .org file is authoritative; back-out and then merge changes into it ASAP in case of error.

#+TOC: headlines 4
