README.org
*** ITEMS
1. Directors shall write policy as needed, and
2. Absent an prior or conflicting policy that policy is immediately in effect, where
3. Policy once effective is binding to/for all our agents and assignees including but not limited to all of our volunteers including our directors.
4. When we replace/amend our policies including this one, and given due notification (e.g, by electronic mail) of all of the directors, this policy and any other of our policies are effective once acknowledged and consented to by one or more other director such that two of our directors have considered the changes,
5. Unless a director shall object (e.g. by comment, verbally, or by other means) in a timely manner, and then
6. Once objected to, policy is effective when consented to a by duly recorded majority representing a quorum of directors.
7. Directors shall raise at their first opportunity objection on behalf of our other volunteers when each shall perceive a consensus or significant majority of affected parties under their supervision have voiced their concerns in good faith concern and given the director shall find such concern may have merit, however
8. Directors are not otherwise obligated to represent or act on behalf of others (for example, of any other of our volunteers) and shall act on their own best knowledge and belief when drafting and reviewing policy, and always that
9. Directors and all other of our volunteers shall always act to the greatest extent they are able within the confines of this and other Fosshost policy, and
10. We shall each use our best judgment striving for prudence and consistency, for example when our policies may appear to conflict, and that
11. At all times we each shall conduct ourselves within our understood legal and ethical confines, such as of applicable law and regulation, and that
12. Each of us shall take it upon ourselves to certify notification to all of our directors any the event they in good faith believe doubt the legally binding nature of this or any Fosshost policy or when they in good faith believe a director or other volunteer may have violated any Fosshost policy,
13. And the secretary shall acknowledge and record any such change, objection, and notification made under this policy and produce such records as needed to conduct our business and upon duly verified request from any and all such entity may have the legal right to make such a demand upon Fosshost, for example the government of the United Kingdom in the course of verifying or investigating our records as permitted and allowed for under UK law,
14. And any and all such which actions required and allowed by our policies as specifically called out, for example for a particular officer or volunteer may be otherwise assigned or delegated as otherwise consistent with Fosshost policies, for example the Secretary may delegate and share information (for example, with other volunteers) as may be necessary, expedient, and consistent with our policies, in order to make, keep, and produce records,
15. And where our policies, of which this forms a part, are not to conflict with our articles,
16. And where in conflict, our articles are considered before and superior to our policies including this one,
17. Except as may relate to amending our articles and related process, where our articles may for a period of not more than three months ("one quarter", usually around 90days) have superseded our articles given they contain such changes as can and do affect our our articles and/or he process by which we have agreed to revise our articles, whereas this may allow us time needed to review and record such changes and to file those changes with external entities such as the UK CIC.

** Our Values and Ethics Policy
#+BEGIN_QUOTE
A statement of our values and accountability.
#+END_QUOTE
*** SUMMARY
The ITEMS following create a basis for a guarantee of good faith in the public interest by stating our values and framework for accountability.  To that end, the language in this section should be simple and unembellished.

NOTE: this is a summary, refer to the ITEMS below for binding policy language.
*** ITEMS
    1. We seek at all times to earn and to be worthy of trust, and
    2. seek to be respectfully transparent, and
    3. seek to be appropriately discreet, and
    4. seek to communicate faithfully, and
    5. seek to pursue our duties with all due diligence.
    6. We will at all times be honest, and
    7. we will comply with our polices,
    8. we will share and explain our work freely, and
    9. we will prefer, promote, and model the best ideals of the Free and Open Source software communities we host and/or endorse, and
    10. we will show our same values to all people and communities.

** Our Community Policy
#+BEGIN_QUOTE
A somewhat intense statement of our specific mission in serving the general interest.
#+END_QUOTE
*** SUMMARY
The ITEMS following align our policy to our mission ("We're on a mission
to empower and support every free and open-source software project. To
go further, together. Our work never stops.").

To that end, this section provides working definitions for certain
"terms of art" (words or phrases, often with synonyms that may appear
interchangeably with the original term throughout our policy, and
which may take on additional or unconventional meaning within the
context of our operations or which we may for other reasons clarify)
and that help to identify and distinguish the interests we serve.

NOTE: this is a summary, refer to the ITEMS below for binding policy language.
