README.org
*** ITEMS
    1. FOSS ("FLOSS", "Free Software", "Open Source Software" "Open Source", "Free and Open Source Software")
       1. will usually refer to a product or a combination of products ("program"), and
	  1. includes the program source and other materials in any form or forms ("sources and binaries"), and
	     1. being duly described ("documented"), and
	     2. authored, edited, and/or created ("authored", "maintained"), and
	     3. compiled, built, tested, and distributed ("packaged", "released"), and
	     4. used ("used", "tested", "developed"), and
		1. each of these given above apply ("complete program", "complete work"), or
		2. or when one or more of these above ("developed and/or used", etc.) apply, and
	     5. one or more such program once installed (e.g. service, job, instance, virtual machine, or client),
		1. Such that the program runs or will run ("run", "executed"), and
		   1. Such that one or more
		   2. servers, desktop and/or laptop computers, mobile devices such as smart phones ("machine"), or
		   3. such simulated by electronic means ("virtual machine"), or
		2. such that a program, service, or capability becomes available ("FOSSaaS"), or
		3. such that a task is performed or will be performed ("FOSS Script"), or
		4. a physical or simulated physical computing device providing such ("FOSS device"), or
	     6. any other mechanical or other device that can run the program ("FOSS machine"),
	  2. Or otherwise causing a program or code for a program to be
	     1. developed ("FOSS creation"), or
	     2. executed ("FOSS use"),
	  3. But only when developed and/or used under and per the terms of a license ("FOSS program")
	     1. [[https://www.gnu.org/licenses/license-list.en.html][endorsed or approved]] by the Free Software Foundation ("FSF"), or
	     2. meeting [[https://opensource.org/osd][Open Source Definition]] (ODS) criteria of the Open Source Initiative ("OSI"),
       2. But may also refer
	  1. To a specific person, or specific persons, or specific group of persons ("community"), who
	     1. voluntary develops a specific FOSS program or programs ("FOSS developer", "FOSS project", "project"), or
	     2. Uses and promotes the use of a FOSS program ("FOSS user"), or
	  2. To a group of such person ("FOSS user group", "FOSS user community"), or
	  3. To any other person or community who in and from good standing and in good faith ("well regarded) does
	     1. meaningfully and demonstrably support FOSS project or projects ("FOSS supporter"), and
		1. regularly organizes support for FOSS projects ("FOSS Community Interest Organization"), or
		2. by other conduct, communication or other specific and recognized act ("support"), does
	     2. further FOSS development ("FOSS community member"), or
	     3. does more than more than one of these ("FOSS Community").
    2. FOSS Hosting and Service ("hosting")
       1. Our purpose and function ("mission") is to provide this, meaning
       2. our records as a registered and accountable organization ("records", "Fosshost records"),
       3. shall relate to that business, and including
	  1. internal accounting and reporting, and
	  2. such external accounting as we are duly required to produce, and
       4. shall relate that business to our practices as a FOSS Community Interest Organization, and that
       5. Fosshost shall in all policies ("comprehensively"), and
	  1. Other regular and authorized procedures ("procedures"),
	  2. and organizational practice ("tradition"),
       6. keep such records as are or may be vital ("vital records"), and
       7. to establish and retain within Fosshost records ("keep")
	  1. such information as may be needed to account, track, measure or otherwise calculate
	  2. our assets, and
	  3. our liabilities, and
	  4. our affect on our community, and
	  5. our understanding of and respect for FOSS, and to
       8. relate such information to our mission as best we can, and to
       9. periodically and as necessary review comprehensively ("audit", "self audit"), and
       10. consider the results of such audits as vital records, and
       11. and including as vital records any and all records showing specific and unacceptable ("malfeasance"),
	   1. action taken by Fosshost ("impropriety"), and
	   2. action taken our behalf and with our general knowledge and consent ("collusion"),
       12. and to include as vital such records substantiating malfeasance as we can find, including
	   1. detailed instructions related to the performance of the audit, and
	   2. the results of the audit including actions taken in consequence, and
	      1. in cases where malfeasance has
		 1. been found, or
		 2. is suspected to have occured, and
	      2. including any and all access records and logs and other technical work-product, and
	      3. receipts, invoices, and internal and external communications we might not otherwise share, and
	      4. that may constituent or corroborate the audit which has found malfeasance, and to
       13. bring that information forward ("notification of malfeasance") to
	   1. the FOSS community, and
	   2. the general public, and,
	   3. appropriate regulatory bodies or agencies, and
	   4. any other public body, such as
	      1. applicable law enforcement,
	      2. where and as may be prudent and advisable.
    3. Empower and Support every Free and Open Source Software project ("provide")
       1. Our mission is to offer hosting to FOSS projects and communities, ("tenants", "applicants"), and
       2. we act at our own discretion, for example including
	  1. making any offer of hosting, and
	  2. providing such hosting, and
	  3. deciding to retract or withdraw or otherwise terminate such hosting or any offer of hosting, and
	  4. to do any and all of these according to our own policy and judgment, and
       3. we do so without guarantees other than those specified herein, but
       4. always after due diligence including (but not limited to) consideration of:
	  1. our ability to access and verify the relationship between the tenant/prospect and the community, and
	  2. our estimation of the value or potential value provided to the community, and
	  3. our consideration of such estimation relative to others that we host or may in the future host, and
	  4. any specific concern or concerns we may have, for example such as
	     1. the likelihood a tenant/prospect has and/or will comply our policies and other stated expectations,
	     2. the general intentions and/or conduct of tenant/prospect as perceived by Fosshost,
	     3. any specific technical or organizational risk we find tenant/prospect poses to us or the community,
	     4. any other specific concerns we may at our sole discretion find and duly deliberate and record.
    4. To go further, together ("cooperate", "collaborate"), meaning
       1. we use and provide only FOSS software as part of our service, and while
       2. we may at our discretion use other commercial/non-FOSS software, nevertheless
       3. we work to remove any non-FOSS software from our operating practices, and
       4. we will at no time endorse, promote, sell, or resell commercial/non-FOSS software, and especially that
       5. we will do not and will not endorse specifically any provider of commercial software on that basis.
    5. Our work never stops ("ongoing"), meaning
       1. our commitment to the community is not limited in or by duration, however
       3. we may be temporarily or permanently unable to continue offering and/or providing some or all services, for example
       2. we may reach limits based on resources such as technical or of labor, or
       4. be otherwise limited, such as
	  1. at and by our discretion and/or policy, and/or
	  2. by our legal and ethical obligations, and/or otherwise
	  3. by our general obligation to promote and preserve
	     1. our organization, and/or the
	     2. FOSS community, and/or
	     3. our duty to serve the public good.

