README.html
<div id="outline-container-org04a21d4" class="outline-4">
<h4 id="org04a21d4"><span class="section-number-4">1.3.2</span> ITEMS</h4>
<div class="outline-text-4" id="text-1-3-2">
<ol class="org-ol">
<li>FOSS ("FLOSS", "Free Software", "Open Source Software" "Open Source", "Free and Open Source Software")
<ol class="org-ol">
<li>will usually refer to a product or a combination of products ("program"), and
<ol class="org-ol">
<li>includes the program source and other materials in any form or forms ("sources and binaries"), and
<ol class="org-ol">
<li>being duly described ("documented"), and</li>
<li>authored, edited, and/or created ("authored", "maintained"), and</li>
<li>compiled, built, tested, and distributed ("packaged", "released"), and</li>
<li>used ("used", "tested", "developed"), and
<ol class="org-ol">
<li>each of these given above apply ("complete program", "complete work"), or</li>
<li>or when one or more of these above ("developed and/or used", etc.) apply, and</li>
</ol></li>
<li>one or more such program once installed (e.g. service, job, instance, virtual machine, or client),
<ol class="org-ol">
<li>Such that the program runs or will run ("run", "executed"), and
<ol class="org-ol">
<li>Such that one or more</li>
<li>servers, desktop and/or laptop computers, mobile devices such as smart phones ("machine"), or</li>
<li>such simulated by electronic means ("virtual machine"), or</li>
</ol></li>
<li>such that a program, service, or capability becomes available ("FOSSaaS"), or</li>
<li>such that a task is performed or will be performed ("FOSS Script"), or</li>
<li>a physical or simulated physical computing device providing such ("FOSS device"), or</li>
</ol></li>
<li>any other mechanical or other device that can run the program ("FOSS machine"),</li>
</ol></li>
<li>Or otherwise causing a program or code for a program to be
<ol class="org-ol">
<li>developed ("FOSS creation"), or</li>
<li>executed ("FOSS use"),</li>
</ol></li>
<li>But only when developed and/or used under and per the terms of a license ("FOSS program")
<ol class="org-ol">
<li><a href="https://www.gnu.org/licenses/license-list.en.html">endorsed or approved</a> by the Free Software Foundation ("FSF"), or</li>
<li>meeting <a href="https://opensource.org/osd">Open Source Definition</a> (ODS) criteria of the Open Source Initiative ("OSI"),</li>
</ol></li>
</ol></li>
<li>But may also refer
<ol class="org-ol">
<li>To a specific person, or specific persons, or specific group of persons ("community"), who
<ol class="org-ol">
<li>voluntary develops a specific FOSS program or programs ("FOSS developer", "FOSS project", "project"), or</li>
<li>Uses and promotes the use of a FOSS program ("FOSS user"), or</li>
</ol></li>
<li>To a group of such person ("FOSS user group", "FOSS user community"), or</li>
<li>To any other person or community who in and from good standing and in good faith ("well regarded) does
<ol class="org-ol">
<li>meaningfully and demonstrably support FOSS project or projects ("FOSS supporter"), and
<ol class="org-ol">
<li>regularly organizes support for FOSS projects ("FOSS Community Interest Organization"), or</li>
<li>by other conduct, communication or other specific and recognized act ("support"), does</li>
</ol></li>
<li>further FOSS development ("FOSS community member"), or</li>
<li>does more than more than one of these ("FOSS Community").</li>
</ol></li>
</ol></li>
</ol></li>
<li>FOSS Hosting and Service ("hosting")
<ol class="org-ol">
<li>Our purpose and function ("mission") is to provide this, meaning</li>
<li>our records as a registered and accountable organization ("records", "Fosshost records"),</li>
<li>shall relate to that business, and including
<ol class="org-ol">
<li>internal accounting and reporting, and</li>
<li>such external accounting as we are duly required to produce, and</li>
</ol></li>
<li>shall relate that business to our practices as a FOSS Community Interest Organization, and that</li>
<li>Fosshost shall in all policies ("comprehensively"), and
<ol class="org-ol">
<li>Other regular and authorized procedures ("procedures"),</li>
<li>and organizational practice ("tradition"),</li>
</ol></li>
<li>keep such records as are or may be vital ("vital records"), and</li>
<li>to establish and retain within Fosshost records ("keep")
<ol class="org-ol">
<li>such information as may be needed to account, track, measure or otherwise calculate</li>
<li>our assets, and</li>
<li>our liabilities, and</li>
<li>our affect on our community, and</li>
<li>our understanding of and respect for FOSS, and to</li>
</ol></li>
<li>relate such information to our mission as best we can, and to</li>
<li>periodically and as necessary review comprehensively ("audit", "self audit"), and</li>
<li>consider the results of such audits as vital records, and</li>
<li>and including as vital records any and all records showing specific and unacceptable ("malfeasance"),
<ol class="org-ol">
<li>action taken by Fosshost ("impropriety"), and</li>
<li>action taken our behalf and with our general knowledge and consent ("collusion"),</li>
</ol></li>
<li>and to include as vital such records substantiating malfeasance as we can find, including
<ol class="org-ol">
<li>detailed instructions related to the performance of the audit, and</li>
<li>the results of the audit including actions taken in consequence, and
<ol class="org-ol">
<li>in cases where malfeasance has
<ol class="org-ol">
<li>been found, or</li>
<li>is suspected to have occured, and</li>
</ol></li>
<li>including any and all access records and logs and other technical work-product, and</li>
<li>receipts, invoices, and internal and external communications we might not otherwise share, and</li>
<li>that may constituent or corroborate the audit which has found malfeasance, and to</li>
</ol></li>
</ol></li>
<li>bring that information forward ("notification of malfeasance") to
<ol class="org-ol">
<li>the FOSS community, and</li>
<li>the general public, and,</li>
<li>appropriate regulatory bodies or agencies, and</li>
<li>any other public body, such as
<ol class="org-ol">
<li>applicable law enforcement,</li>
<li>where and as may be prudent and advisable.</li>
</ol></li>
</ol></li>
</ol></li>
<li>Empower and Support every Free and Open Source Software project ("provide")
<ol class="org-ol">
<li>Our mission is to offer hosting to FOSS projects and communities, ("tenants", "applicants"), and</li>
<li>we act at our own discretion, for example including
<ol class="org-ol">
<li>making any offer of hosting, and</li>
<li>providing such hosting, and</li>
<li>deciding to retract or withdraw or otherwise terminate such hosting or any offer of hosting, and</li>
<li>to do any and all of these according to our own policy and judgment, and</li>
</ol></li>
<li>we do so without guarantees other than those specified herein, but</li>
<li>always after due diligence including (but not limited to) consideration of:
<ol class="org-ol">
<li>our ability to access and verify the relationship between the tenant/prospect and the community, and</li>
<li>our estimation of the value or potential value provided to the community, and</li>
<li>our consideration of such estimation relative to others that we host or may in the future host, and</li>
<li>any specific concern or concerns we may have, for example such as
<ol class="org-ol">
<li>the likelihood a tenant/prospect has and/or will comply our policies and other stated expectations,</li>
<li>the general intentions and/or conduct of tenant/prospect as perceived by Fosshost,</li>
<li>any specific technical or organizational risk we find tenant/prospect poses to us or the community,</li>
<li>any other specific concerns we may at our sole discretion find and duly deliberate and record.</li>
</ol></li>
</ol></li>
</ol></li>
<li>To go further, together ("cooperate", "collaborate"), meaning
<ol class="org-ol">
<li>we use and provide only FOSS software as part of our service, and while</li>
<li>we may at our discretion use other commercial/non-FOSS software, nevertheless</li>
<li>we work to remove any non-FOSS software from our operating practices, and</li>
<li>we will at no time endorse, promote, sell, or resell commercial/non-FOSS software, and especially that</li>
<li>we will do not and will not endorse specifically any provider of commercial software on that basis.</li>
</ol></li>
<li>Our work never stops ("ongoing"), meaning
<ol class="org-ol">
<li>our commitment to the community is not limited in or by duration, however</li>
<li>we may be temporarily or permanently unable to continue offering and/or providing some or all services, for example</li>
<li>we may reach limits based on resources such as technical or of labor, or</li>
<li>be otherwise limited, such as
<ol class="org-ol">
<li>at and by our discretion and/or policy, and/or</li>
<li>by our legal and ethical obligations, and/or otherwise</li>
<li>by our general obligation to promote and preserve
<ol class="org-ol">
<li>our organization, and/or the</li>
<li>FOSS community, and/or</li>
<li>our duty to serve the public good.</li>
</ol></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>
