README.org
** Our Teamwork Policy

#+BEGIN_QUOTE
Clear expectations make the dream work.
#+END_QUOTE

*** SUMMARY
The ITEMS following define teamwork as expectations regarding collaboration.

NOTE: this is a summary, refer to the ITEMS below for binding policy language.

*** ITEMS
1. Notwithstanding we are expressly prohibited/restricted, we will generally
   1. Focus our resources first toward our community, and
   2. Self-host things that generally provide model projects to our community ("reference implementations"), both
      1. Publishing deliberately well maintained technical work, and
      2. Clearly grounding such works to and within our organization, including
	 1. By regular demonstration of organizational confidence, such as
	    1. By duly recorded review open among all our volunteers, and
	    2. Regularly and diligent review of these, and
	    3. For any regular and diligent review of these or any of our other technical and training and/or policy and procedure making materials, and/or
	    4. As required to demonstrate or supervise or otherwise verify compliance or suitability with or of these or other of our policies and procedures, and
	 2. Otherwise at the desecration of our directors, starting with
	    1. Director CEO (Thomas Markee), or if he should not dissent
	    2. Other of our volunteers such as our directors may designate, and
      3. Otherwise we will not generally host significant capabilities of/for our own principle use, including
	 1. We may, at our sole digression and for our internal/volunteer use only
	 2. Accept or purchase software including software as a service products ("Non-FOSS tools"), when and given
	    1. The external host or service proving organization ("Commercial provider") will provide to us either,
	       1. Commercial providers may offer us service at no cost and/or without fees, or when
	       2. We may receive special recognition (e.g. as a charitable organization), and when and after
		  1. the secretary shall record such relationship, and
		  2. such relationship shall be caused by a director to exist, when and given
		  3. no director shall object, or after and beyond such objection and then only
		  4. after a quorum of directors is reached and duly recorded such as to overcome objection, and
   3. We will cooperate in our regular and routine duties, such as
      1. Seeking guidance ("supervision") when we do not understand something, and
      2. Involving others as available in decision making, and
      3. To help all volunteers understand our work, for example
	 1. Understanding what others want to learn as well as what they know, and
	 2. Ensuring that helpful information is duly recorded, and
	 3. Periodically considering and duly recording the diversity of views within our organization and community as may pertain, and
      4. Keeping such records as required or allowed by these polices, for example to
	 1. See that actions we believe may be in poor faith are duly recorded, and
	 2. In such a way as to be findable and understandable throughout or organization, and
	 3. Meet other commitments made by law/regulation or here in by policy, or
	 4. As otherwise directed when
	    1. allowed or otherwise provided for by policy, or
	    2. As duly recorded by the secretary as acknowledged by consensus or quorum of our managing and executive directors.

** Our Sponsorship and Contribution Policy

#+BEGIN_QUOTE
Sometimes giving it our all means we find we didn't give it our best, or vice versa. We can work on that. Together.
#+END_QUOTE

*** SUMMARY
The ITEMS following define our goals in terms of publishing our
results and general work product as widely as possible given
different circumstances we may or routinely face.

In doing so, this section establishes the basis for other "practices",
which may be documented and maintainenced outside our policy
(e.g. this document).  Our goal is to allow our routine activities to
addressed in a number of ways depending on the tastes and interests
among our volunteers, while ensuring that, as an organization, we keep
an retain consistent records and handle each appropriately.

NOTE: this is a summary, refer to the ITEMS below for binding policy
language.

