README.html

<div id="outline-container-org71983c0" class="outline-3">
<h3 id="org71983c0"><span class="section-number-3">1.4</span> Our Teamwork Policy</h3>
<div class="outline-text-3" id="text-1-4">
<blockquote>
<p>
Clear expectations make the dream work.
</p>
</blockquote>
</div>

<div id="outline-container-org3d9557e" class="outline-4">
<h4 id="org3d9557e"><span class="section-number-4">1.4.1</span> SUMMARY</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
The ITEMS following define teamwork as expectations regarding collaboration.
</p>

<p>
NOTE: this is a summary, refer to the ITEMS below for binding policy language.
</p>
</div>
</div>

<div id="outline-container-org78de606" class="outline-4">
<h4 id="org78de606"><span class="section-number-4">1.4.2</span> ITEMS</h4>
<div class="outline-text-4" id="text-1-4-2">
<ol class="org-ol">
<li>Notwithstanding we are expressly prohibited/restricted, we will generally
<ol class="org-ol">
<li>Focus our resources first toward our community, and</li>
<li>Self-host things that generally provide model projects to our community ("reference implementations"), both
<ol class="org-ol">
<li>Publishing deliberately well maintained technical work, and</li>
<li>Clearly grounding such works to and within our organization, including
<ol class="org-ol">
<li>By regular demonstration of organizational confidence, such as
<ol class="org-ol">
<li>By duly recorded review open among all our volunteers, and</li>
<li>Regularly and diligent review of these, and</li>
<li>For any regular and diligent review of these or any of our other technical and training and/or policy and procedure making materials, and/or</li>
<li>As required to demonstrate or supervise or otherwise verify compliance or suitability with or of these or other of our policies and procedures, and</li>
</ol></li>
<li>Otherwise at the desecration of our directors, starting with
<ol class="org-ol">
<li>Director CEO (Thomas Markee), or if he should not dissent</li>
<li>Other of our volunteers such as our directors may designate, and</li>
</ol></li>
</ol></li>
<li>Otherwise we will not generally host significant capabilities of/for our own principle use, including
<ol class="org-ol">
<li>We may, at our sole digression and for our internal/volunteer use only</li>
<li>Accept or purchase software including software as a service products ("Non-FOSS tools"), when and given
<ol class="org-ol">
<li>The external host or service proving organization ("Commercial provider") will provide to us either,
<ol class="org-ol">
<li>Commercial providers may offer us service at no cost and/or without fees, or when</li>
<li>We may receive special recognition (e.g. as a charitable organization), and when and after
<ol class="org-ol">
<li>the secretary shall record such relationship, and</li>
<li>such relationship shall be caused by a director to exist, when and given</li>
<li>no director shall object, or after and beyond such objection and then only</li>
<li>after a quorum of directors is reached and duly recorded such as to overcome objection, and</li>
</ol></li>
</ol></li>
</ol></li>
</ol></li>
</ol></li>
<li>We will cooperate in our regular and routine duties, such as
<ol class="org-ol">
<li>Seeking guidance ("supervision") when we do not understand something, and</li>
<li>Involving others as available in decision making, and</li>
<li>To help all volunteers understand our work, for example
<ol class="org-ol">
<li>Understanding what others want to learn as well as what they know, and</li>
<li>Ensuring that helpful information is duly recorded, and</li>
<li>Periodically considering and duly recording the diversity of views within our organization and community as may pertain, and</li>
</ol></li>
<li>Keeping such records as required or allowed by these polices, for example to
<ol class="org-ol">
<li>See that actions we believe may be in poor faith are duly recorded, and</li>
<li>In such a way as to be findable and understandable throughout or organization, and</li>
<li>Meet other commitments made by law/regulation or here in by policy, or</li>
<li>As otherwise directed when
<ol class="org-ol">
<li>allowed or otherwise provided for by policy, or</li>
<li>As duly recorded by the secretary as acknowledged by consensus or quorum of our managing and executive directors.</li>
</ol></li>
</ol></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgbfb904e" class="outline-3">
<h3 id="orgbfb904e"><span class="section-number-3">1.5</span> Our Sponsorship and Contribution Policy</h3>
<div class="outline-text-3" id="text-1-5">
<blockquote>
<p>
Sometimes giving it our all means we find we didn't give it our best, or vice versa. We can work on that. Together.
</p>
</blockquote>
</div>

<div id="outline-container-org5ec214b" class="outline-4">
<h4 id="org5ec214b"><span class="section-number-4">1.5.1</span> SUMMARY</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
The ITEMS following define our goals in terms of publishing our
results and general work product as widely as possible given
different circumstances we may or routinely face.
</p>

<p>
In doing so, this section establishes the basis for other "practices",
which may be documented and maintainenced outside our policy
(e.g. this document).  Our goal is to allow our routine activities to
addressed in a number of ways depending on the tastes and interests
among our volunteers, while ensuring that, as an organization, we keep
an retain consistent records and handle each appropriately.
</p>

<p>
NOTE: this is a summary, refer to the ITEMS below for binding policy
language.
</p>
</div>
</div>
