README.org
*** ITEMS

1. We will seek and regularly report on and record our progress contributing our work back to our community ("contribution report"), and
2. We will similarly seek and regularly report on our transparency ("transparency report"), including
   1. Reporting on the quality and types of information we record and retain but do not publish, and
   2. Reporting on such cases where we publish information only in a limited fashion ("redacted"), and
3. We will similarly seek and regularly report on information and categories of information we posses, require, and provide, including
   1. We will define categories of information with this policy ("information categorization"), and
   2. We will provide clear guidelines in policy information, including those
      1. Which make it clear for volunteers how to categorize information according to our policy, and
      2. For volunteers and others to understand our use and intents regarding the use of records we keep and retain, and
      3. For the retention of information according to category, and
   3. We will at our sole discretion publish in whole, or
   4. We may publish in aggregate or in part or as redacted or to a limited audience where
      1. otherwise as redacted or for limited or audience when such publication is only or best means to provide transparency in consideration of privacy, and
	 1. As duly acknowledged and accepted by one of our directors and as recorded by our secretary, or
	 2. As otherwise made typical according to our customary or deliberate work practices ("practices"), including
	    1. By our regular and consistent exercise of our duties, and
	    2. Where generally well documented and/or otherwise explained or to our volunteers, and
	    3. As duly recorded by our secretary,
	    4. Otherwise as provided for in and by our policies, and
	       1. Otherwise as duly recorded consent of our director shall demand, and when
	       2. Our procedures nor policy nor other due authority such as of regulation prohibit or discourages such publication.
   5. We may retain, as individual contributers, such information as we deem necessary, including to
      1. Establish or verify or investigate any charge or suspicion of ethical or otherwise violation of our policies, for example including
	 1. researching and/or reporting on misuse of our technology or volunteering or other such as financial resources, and
	 2. any attempt to falsify or otherwise intentionally distort or misrepresent our records, and
	 3. to communicate and demonstrate such to our board of directors, and otherwise and always
	    1. as allowed by our policies,
	    2. or required by our procedures,
	    3. or required by external forces such as regulators acting in due course, and
      2. Such as we deem necessary to understand and learn from our work, such as
	 1. Monitoring our own internal network including our tenants use thereof, and
	 2. Recording our meetings and conversations, including with tenants or sponsors, but where as
	 3. We do not share this information without consent or and unless allowed/required by our policy or procedures, and
	 4. We share such information only after removing/concealing sensitive or personal information, for example including
	    1. We restrain from sharing information such as to convey our own or our tenants or sponsors plans and intentions without written connect, and
	    2. We share personally identifying information without concent of those persons identified only as required ("required disclosure"), and
	    3. We provide required disclosure to the minimum audience consistent with expectations, for example
	       1. Only to those individuals or groups required specifically by our procedures or policy, and
	       2. As specifically directed in writing by regulators or other external parties acting in due course.
      3. As we may require to created redacted and otherwise derived materials for purposes of colaboration ("training working materials"), and
      4. As a natural by-product of our usual and customary working habits, for example including our personal IRC or other chat logs, email, etc., However
4. We will similarly seek to delete or otherwise remove information once it is not needed and to regularly report on our success and any concerns related thereto, but
5. We will not generally seek removing our otherwise auditing personal information in our keeping, where
   1. The information has passed to one or some of us naturally in the course of our operations, and
   2. Given such deletion would represent technical challenge or otherwise hardship to/for our volunteers, and
   3. Given no specific requirement exists for such deletion, for example
      1. Given no policy has otherwise been violated, and
      2. Given no procedure has been circumvented or altered, and otherwise
      3. Given retaining such information is not an attempt to avoid due diligence handling our records, and
      4. When and if we possess a reasonable certainty that loss or disclosure is unlikely and avoidable.

** Our Record Keeping ("Privacy") Policy

#+BEGIN_QUOTE
It is difficult to unintentionally disclose what you deliberately don't keep, and you don't have to put it anywhere.
#+END_QUOTE

*** SUMMARY
The ITEMS following define our goals in terms of information handling according to classification.

In doing so, this section establishes a framework for our internal and external practices. specifically:
 * defining a general practice for decision making including information categorization
 * listing the categories of information we recognize
 * describing the purpose and intent of procedures specifically established by our policy for handling information
 * describing how we create and maintenance procedures considering the information sensitivity and other factors

NOTE: this is a summary, refer to the ITEMS below for binding policy language.

