README.html

<div id="outline-container-org6adc86e" class="outline-4">
<h4 id="org6adc86e"><span class="section-number-4">1.5.2</span> ITEMS</h4>
<div class="outline-text-4" id="text-1-5-2">
<ol class="org-ol">
<li>We will seek and regularly report on and record our progress contributing our work back to our community ("contribution report"), and</li>
<li>We will similarly seek and regularly report on our transparency ("transparency report"), including
<ol class="org-ol">
<li>Reporting on the quality and types of information we record and retain but do not publish, and</li>
<li>Reporting on such cases where we publish information only in a limited fashion ("redacted"), and</li>
</ol></li>
<li>We will similarly seek and regularly report on information and categories of information we posses, require, and provide, including
<ol class="org-ol">
<li>We will define categories of information with this policy ("information categorization"), and</li>
<li>We will provide clear guidelines in policy information, including those
<ol class="org-ol">
<li>Which make it clear for volunteers how to categorize information according to our policy, and</li>
<li>For volunteers and others to understand our use and intents regarding the use of records we keep and retain, and</li>
<li>For the retention of information according to category, and</li>
</ol></li>
<li>We will at our sole discretion publish in whole, or</li>
<li>We may publish in aggregate or in part or as redacted or to a limited audience where
<ol class="org-ol">
<li>otherwise as redacted or for limited or audience when such publication is only or best means to provide transparency in consideration of privacy, and
<ol class="org-ol">
<li>As duly acknowledged and accepted by one of our directors and as recorded by our secretary, or</li>
<li>As otherwise made typical according to our customary or deliberate work practices ("practices"), including
<ol class="org-ol">
<li>By our regular and consistent exercise of our duties, and</li>
<li>Where generally well documented and/or otherwise explained or to our volunteers, and</li>
<li>As duly recorded by our secretary,</li>
<li>Otherwise as provided for in and by our policies, and
<ol class="org-ol">
<li>Otherwise as duly recorded consent of our director shall demand, and when</li>
<li>Our procedures nor policy nor other due authority such as of regulation prohibit or discourages such publication.</li>
</ol></li>
</ol></li>
</ol></li>
</ol></li>
<li>We may retain, as individual contributers, such information as we deem necessary, including to
<ol class="org-ol">
<li>Establish or verify or investigate any charge or suspicion of ethical or otherwise violation of our policies, for example including
<ol class="org-ol">
<li>researching and/or reporting on misuse of our technology or volunteering or other such as financial resources, and</li>
<li>any attempt to falsify or otherwise intentionally distort or misrepresent our records, and</li>
<li>to communicate and demonstrate such to our board of directors, and otherwise and always
<ol class="org-ol">
<li>as allowed by our policies,</li>
<li>or required by our procedures,</li>
<li>or required by external forces such as regulators acting in due course, and</li>
</ol></li>
</ol></li>
<li>Such as we deem necessary to understand and learn from our work, such as
<ol class="org-ol">
<li>Monitoring our own internal network including our tenants use thereof, and</li>
<li>Recording our meetings and conversations, including with tenants or sponsors, but where as</li>
<li>We do not share this information without consent or and unless allowed/required by our policy or procedures, and</li>
<li>We share such information only after removing/concealing sensitive or personal information, for example including
<ol class="org-ol">
<li>We restrain from sharing information such as to convey our own or our tenants or sponsors plans and intentions without written connect, and</li>
<li>We share personally identifying information without concent of those persons identified only as required ("required disclosure"), and</li>
<li>We provide required disclosure to the minimum audience consistent with expectations, for example
<ol class="org-ol">
<li>Only to those individuals or groups required specifically by our procedures or policy, and</li>
<li>As specifically directed in writing by regulators or other external parties acting in due course.</li>
</ol></li>
</ol></li>
</ol></li>
<li>As we may require to created redacted and otherwise derived materials for purposes of colaboration ("training working materials"), and</li>
<li>As a natural by-product of our usual and customary working habits, for example including our personal IRC or other chat logs, email, etc., However</li>
</ol></li>
</ol></li>
<li>We will similarly seek to delete or otherwise remove information once it is not needed and to regularly report on our success and any concerns related thereto, but</li>
<li>We will not generally seek removing our otherwise auditing personal information in our keeping, where
<ol class="org-ol">
<li>The information has passed to one or some of us naturally in the course of our operations, and</li>
<li>Given such deletion would represent technical challenge or otherwise hardship to/for our volunteers, and</li>
<li>Given no specific requirement exists for such deletion, for example
<ol class="org-ol">
<li>Given no policy has otherwise been violated, and</li>
<li>Given no procedure has been circumvented or altered, and otherwise</li>
<li>Given retaining such information is not an attempt to avoid due diligence handling our records, and</li>
<li>When and if we possess a reasonable certainty that loss or disclosure is unlikely and avoidable.</li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9398a85" class="outline-3">
<h3 id="org9398a85"><span class="section-number-3">1.6</span> Our Record Keeping ("Privacy") Policy</h3>
<div class="outline-text-3" id="text-1-6">
<blockquote>
<p>
It is difficult to unintentionally disclose what you deliberately don't keep, and you don't have to put it anywhere.
</p>
</blockquote>
</div>
