README.org
*** ITEMS

1. We handle all information according to our policy (this document or documents), and whereas
   1. We may occasionally deviate from our routine, normal or desired processes ("exceptions"), therefor
      1. Our directors shall be informed of any and all deviations to policy, for example including but not limited to
	 1. Failures, whether preventable or not, resulting in unplanned disclosure of information ("privacy event"), and
	 2. Significant errors, for example on our own part, whether or not they have caused a privacy event ("incidents"), and
	 3. Concerns related of use of our network, labor, or other resources for purposes other then their intended and acceptable uses ("misuse"), and
      2. Our secretary or designate or by other process we shall record and seek to reduce exceptions ("exception controls"), and
	 1. Each such identified or anticipated deviation shall be documented ("exception record"), including
	    1. describing any understood risks our community, sponsors, tenants, and our network, volunteers, and organization, and
	    2. placed the exception in contrast with our otherwise typical or desired practices, and
	    3. make clear the purpose and necessity and planned or expected duration of the exception, and
	 2. Such documentation shall have periodic review as to the risk/cost and necessity/duration of each exception, and
	 3. Our directors report in summary periodically on the aggregate frequency, risks, costs, and planned actions related to exceptions, however excluding whereas
      3. Our directors shall approve and duly record any routine or acceptable exception ("standard exception"), and
	 1. Such exception as shall be duly documented such as provided for by and within our procedures, and
	 2. Such exception shall in all other respects not expressly documented be otherwise consistent with our policies and obligations, and
	 3. Given such standard exceptions are also included in summary review and reporting in terms of aggregate risk/cost, and because
2. We may and do frequently possess and sometimes may publish information that usually we will usually undertake to keep secret ("restricted"), such as
   1. The address, email or otherwise, or other identifying information ("PII"), including of
      1. this or other information related to our volunteers, and/or
      2. this and other information related to our tenants, and/or
      3. this and other information related to our sponsors, and/or
      4. this and other information related to more than one of these, and also
   2. We may and routinely do use and retain restricted information according to our typical and necessary practices, however
   3. We do not and will publish confidential or restricted or uncategorized information in order to make it known beyond our own internal and short-term need, meaning
      1. when required according to our policies, and
      2. when required by our procedures, or
      3. when compelled by another agency such as a regulator acting in due course, however
   4. We may request specifically in writing permissions to publish information certain we would otherwise treat as restricted or confidential, for example
      1. When such publication will or may benefit our organization and/or community ("Public Relations" "PR"), or
      2. When necessary to provide or transfer or otherwise effect or establish a service, or
      3. When such publication will or may demonstrate misuse, or
      4. When such publication will or may demonstrate other unethical or illegal conduct, however
   5. At our sole digression we may publish restricted information without consent, for example in cases where
      1. Such request for consent may impede or otherwise harm investigation related  to misuse or attempted misuse, including
	 1. of or by Fosshost including any and all of our directors and other volunteers, and/or
	 2. of or by an outside agency acting in due course, therefore
3. Fosshost C.I.C, including it's directors and other volunteers each commit to
   1. classify and property handle information according policy and per the sensitively and importance of such information as we handle, and
   2. report and otherwise cause and enable or directors and secretary to record and be aware of exceptions to our usual practices as describe here, and
   3. to undertake to understand, follow, and improve our practices and especial as may be more or less directly related to protecting and securing information, including
      1. All treating as secret and use and otherwise handle with care all restricted information, and
      2. To handle and use similarly any and all other information we do not generally disclose ("confidental"), for example including
	 1. other information provided by or available though our relationships with Fosshost, and
	 2. When that same information or demonstrated conclusion or other data is not generally known ("secret"), and
	 3. Absent explicit permission ("disclosure permissions")
	    1. in writing, and
	    2. from any and all authorized and direct sources or contributers, and
	 4. Unless said disclosure permissions grant us authority to more freely and/or publicly disclose said information, therefore
4. We otherwise generally do not release confidential or restricted or unclassified information, and
5. We generally do release all other information we specifically retain including and for our and the public record, unless and
   1. when they are not considered as confidential or restricted or otherwise withheld for example by exception or pending review, however
   2. we do so make information public only at our sole digression, and also
      1. according to our policies, and
      2. as required by our specific, routine, and well documented procedures, and
      3. as we may find necessary in order to report publicly on our application of our policy, and
      4. as we may find necessary to keep records pertaining to exceptions to our policy, and
      5. we may make such reports available to the general public and others without prior notification or consent, and also
6. We always comply when justly and duly compelled to disclose information, including
   1. Passing such information to external entities as we must, for example
      1. Per and considering our own policies, and
      2. According to and in the justly required service or dictates of eternal entities such as regulators and/or law enforcement, and
   2. We will initiate such processes as may lead to such disclosure as we are ethical or procedurally obligated, and
7. Where not stated or required of us otherwise, we place the information that is not confidential or restricted into the public domain, and
8. We share information in the public domain at our digression, but
9. We regularly review and record on any and all information we handle or retain which is not made public, and
10. We share such aggregate and summary reporting regularly and publicly to demonstrate and allow verification of our means and results, where as
11. Our goal is safeguarding and appositely classifying and otherwise handling information at all times, therefor
12. We generally reserve the right to change this or any of our policies without prior notice, but
13. We will provide timely notification of such changes to our sponsors, tenants, and volunteers, and the public, however
14. We may allow for other specific disclosures of information per the discretion of our directors, but, and as always when given
15. We seek to comply with and not to circumvent or avoid any and all such ethical, legal, and organizational obligations as may apply, and by
16. Placing our first priority on protecting and securing any and all non-public ("internal use only") information in our trust, and by
17. Generally seeking to publish information as widely as appears to us useful and practicable given we are not otherwise prohibited or constrained.

