README.html

<div id="outline-container-org0c8ee8a" class="outline-4">
<h4 id="org0c8ee8a"><span class="section-number-4">1.6.1</span> SUMMARY</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
The ITEMS following define our goals in terms of information handling according to classification.
</p>

<p>
In doing so, this section establishes a framework for our internal and external practices. specifically:
</p>
<ul class="org-ul">
<li>defining a general practice for decision making including information categorization</li>
<li>listing the categories of information we recognize</li>
<li>describing the purpose and intent of procedures specifically established by our policy for handling information</li>
<li>describing how we create and maintenance procedures considering the information sensitivity and other factors</li>
</ul>

<p>
NOTE: this is a summary, refer to the ITEMS below for binding policy language.
</p>
</div>
</div>

<div id="outline-container-org2b62d16" class="outline-4">
<h4 id="org2b62d16"><span class="section-number-4">1.6.2</span> ITEMS</h4>
<div class="outline-text-4" id="text-1-6-2">
<ol class="org-ol">
<li>We handle all information according to our policy (this document or documents), and whereas
<ol class="org-ol">
<li>We may occasionally deviate from our routine, normal or desired processes ("exceptions"), therefor
<ol class="org-ol">
<li>Our directors shall be informed of any and all deviations to policy, for example including but not limited to
<ol class="org-ol">
<li>Failures, whether preventable or not, resulting in unplanned disclosure of information ("privacy event"), and</li>
<li>Significant errors, for example on our own part, whether or not they have caused a privacy event ("incidents"), and</li>
<li>Concerns related of use of our network, labor, or other resources for purposes other then their intended and acceptable uses ("misuse"), and</li>
</ol></li>
<li>Our secretary or designate or by other process we shall record and seek to reduce exceptions ("exception controls"), and
<ol class="org-ol">
<li>Each such identified or anticipated deviation shall be documented ("exception record"), including
<ol class="org-ol">
<li>describing any understood risks our community, sponsors, tenants, and our network, volunteers, and organization, and</li>
<li>placed the exception in contrast with our otherwise typical or desired practices, and</li>
<li>make clear the purpose and necessity and planned or expected duration of the exception, and</li>
</ol></li>
<li>Such documentation shall have periodic review as to the risk/cost and necessity/duration of each exception, and</li>
<li>Our directors report in summary periodically on the aggregate frequency, risks, costs, and planned actions related to exceptions, however excluding whereas</li>
</ol></li>
<li>Our directors shall approve and duly record any routine or acceptable exception ("standard exception"), and
<ol class="org-ol">
<li>Such exception as shall be duly documented such as provided for by and within our procedures, and</li>
<li>Such exception shall in all other respects not expressly documented be otherwise consistent with our policies and obligations, and</li>
<li>Given such standard exceptions are also included in summary review and reporting in terms of aggregate risk/cost, and because</li>
</ol></li>
</ol></li>
</ol></li>
<li>We may and do frequently possess and sometimes may publish information that usually we will usually undertake to keep secret ("restricted"), such as
<ol class="org-ol">
<li>The address, email or otherwise, or other identifying information ("PII"), including of
<ol class="org-ol">
<li>this or other information related to our volunteers, and/or</li>
<li>this and other information related to our tenants, and/or</li>
<li>this and other information related to our sponsors, and/or</li>
<li>this and other information related to more than one of these, and also</li>
</ol></li>
<li>We may and routinely do use and retain restricted information according to our typical and necessary practices, however</li>
<li>We do not and will publish confidential or restricted or uncategorized information in order to make it known beyond our own internal and short-term need, meaning
<ol class="org-ol">
<li>when required according to our policies, and</li>
<li>when required by our procedures, or</li>
<li>when compelled by another agency such as a regulator acting in due course, however</li>
</ol></li>
<li>We may request specifically in writing permissions to publish information certain we would otherwise treat as restricted or confidential, for example
<ol class="org-ol">
<li>When such publication will or may benefit our organization and/or community ("Public Relations" "PR"), or</li>
<li>When necessary to provide or transfer or otherwise effect or establish a service, or</li>
<li>When such publication will or may demonstrate misuse, or</li>
<li>When such publication will or may demonstrate other unethical or illegal conduct, however</li>
</ol></li>
<li>At our sole digression we may publish restricted information without consent, for example in cases where
<ol class="org-ol">
<li>Such request for consent may impede or otherwise harm investigation related  to misuse or attempted misuse, including
<ol class="org-ol">
<li>of or by Fosshost including any and all of our directors and other volunteers, and/or</li>
<li>of or by an outside agency acting in due course, therefore</li>
</ol></li>
</ol></li>
</ol></li>
<li>Fosshost C.I.C, including it's directors and other volunteers each commit to
<ol class="org-ol">
<li>classify and property handle information according policy and per the sensitively and importance of such information as we handle, and</li>
<li>report and otherwise cause and enable or directors and secretary to record and be aware of exceptions to our usual practices as describe here, and</li>
<li>to undertake to understand, follow, and improve our practices and especial as may be more or less directly related to protecting and securing information, including
<ol class="org-ol">
<li>All treating as secret and use and otherwise handle with care all restricted information, and</li>
<li>To handle and use similarly any and all other information we do not generally disclose ("confidental"), for example including
<ol class="org-ol">
<li>other information provided by or available though our relationships with Fosshost, and</li>
<li>When that same information or demonstrated conclusion or other data is not generally known ("secret"), and</li>
<li>Absent explicit permission ("disclosure permissions")
<ol class="org-ol">
<li>in writing, and</li>
<li>from any and all authorized and direct sources or contributers, and</li>
</ol></li>
<li>Unless said disclosure permissions grant us authority to more freely and/or publicly disclose said information, therefore</li>
</ol></li>
</ol></li>
</ol></li>
<li>We otherwise generally do not release confidential or restricted or unclassified information, and</li>
<li>We generally do release all other information we specifically retain including and for our and the public record, unless and
<ol class="org-ol">
<li>when they are not considered as confidential or restricted or otherwise withheld for example by exception or pending review, however</li>
<li>we do so make information public only at our sole digression, and also
<ol class="org-ol">
<li>according to our policies, and</li>
<li>as required by our specific, routine, and well documented procedures, and</li>
<li>as we may find necessary in order to report publicly on our application of our policy, and</li>
<li>as we may find necessary to keep records pertaining to exceptions to our policy, and</li>
<li>we may make such reports available to the general public and others without prior notification or consent, and also</li>
</ol></li>
</ol></li>
<li>We always comply when justly and duly compelled to disclose information, including
<ol class="org-ol">
<li>Passing such information to external entities as we must, for example
<ol class="org-ol">
<li>Per and considering our own policies, and</li>
<li>According to and in the justly required service or dictates of eternal entities such as regulators and/or law enforcement, and</li>
</ol></li>
<li>We will initiate such processes as may lead to such disclosure as we are ethical or procedurally obligated, and</li>
</ol></li>
<li>Where not stated or required of us otherwise, we place the information that is not confidential or restricted into the public domain, and</li>
<li>We share information in the public domain at our digression, but</li>
<li>We regularly review and record on any and all information we handle or retain which is not made public, and</li>
<li>We share such aggregate and summary reporting regularly and publicly to demonstrate and allow verification of our means and results, where as</li>
<li>Our goal is safeguarding and appositely classifying and otherwise handling information at all times, therefor</li>
<li>We generally reserve the right to change this or any of our policies without prior notice, but</li>
<li>We will provide timely notification of such changes to our sponsors, tenants, and volunteers, and the public, however</li>
<li>We may allow for other specific disclosures of information per the discretion of our directors, but, and as always when given</li>
<li>We seek to comply with and not to circumvent or avoid any and all such ethical, legal, and organizational obligations as may apply, and by</li>
<li>Placing our first priority on protecting and securing any and all non-public ("internal use only") information in our trust, and by</li>
<li>Generally seeking to publish information as widely as appears to us useful and practicable given we are not otherwise prohibited or constrained.</li>
</ol>
</div>
</div>
</div>
