README.org
** Our Approach to Our Work ("Terms of Service", "Terms of Authority") Policy
*** SUMMARY
#+BEGIN_QUOTE
Who washes the mirror of the had that watches itself?
#+END_QUOTE
Overall:

Any service we may provide is offered AS-IS, without warranty (such as of workmanship or fitness to/for purpose) expressed or implied.  In most cases, services including such any and all access we may provide (including to our own volunteers) is provided at each users own risk, at and per our discretion.  In limited circumstances, certain of our staff may have rights and obligations specifically set forth in our policy (for example, to complete or verify self-auditing or related reporting requirements), and in these cases we may generally unable to deny access to certain systems to specific individuals named in this, or other of our policies or, in some limited cases, specific individuals named within our procedures.

In fact, the section may specify some of the above only in outline, for example to more or less strictly influence/establish parameters for our procedures, as may follow our policies,  which we hope we more easily and flexibly change as suit our work-style and preferences, and to make these sorts of internal changes without need to generally engage the board other than a via certain minimum reporting/disclosure specified in and by ITEMS below or by our other policies and procedures.
*** ITEMS
1. At our sole pleasure and convenience we do and may grant or provide any and all products and/or service ("our services"), and as such each
   1. May or can be accessed or used only per our own terms ("terms of service", "ToS", "end user agreement", "agreement", "this agreement"), including
      1. our (Fosshost's, these) policies, procedures, and sometimes including
      2. such items as may materially related among our vital records, and also always including
   2. This agreement which constitute or terms of use is subject to change at our sole discretion and without prior notice or warning, however
      1. We carefully consider any change proposed, including to this and other of our policies, and
	 1. when a proposed change is found by our volunteers to have been put forward in good faith, and then shall
	 2. each proposed change be then reported to our secretary, and
	    1. such reports may be made in summary or some raw form per convenience, however
	    2. the specific intention of the change must be clearly stated, and
	    3. periodically we shall further report on the responses of the board, and
	    4. These and any similar reports may contain or intermix our views, including
	    5. The views of our volunteers and directors, etc. representatives may be considered
	    6. With or without consideration of other factors except
	    7. As specifically as we have agreed, for example by accepting these polices as our Terms and Conditions.
      2. We similarly also carefully consider and periodically may review information submitted to us, for example such as
	 1. application for hosting, and/or
	 2. new applying tenant/project, and/or
	 3. technology as for employment in our network or otherwise use by our volunteers or tenants, and/or
	 4. volunteer who offers to help us, and/or
	 5. donation whether financial, of hardware, or software, or by discount, etc., and then
	 6. we may retain some information from these and/or otherwise refer or excerpt for our records, and
      3. Sometimes personal or otherwise sensitive information is included with or referenced by internal reporting.
      4. We may at our sole discretion elect to withdraw some or all or any service we have provided, and
	 1. we shall report on each invocation of this discretion similarly as for a proposed change to our policies.
      5. We may generally, and except as otherwise stated within our policies or procedures delete or remove at will ("remove", "delete")
	 1. so we may delete at any time any log or other implicit intermediary file or dataset we do not require, or
	 2. so we may elect to retain or use others not specifically assigned/ascribed by us, e.g. for tenant use, and
	 3. so we may delete any other file not so similarly needed or owned after some period of time, and
	 4. although we may notify or attempt to notify tenants of our intention to delete information which may belong to them, however
	 5. we make no implicit promise or guarantee to keep or store information for anyone apart from our own vital records, and
   3. No part of these terms or our policies or other information that we may publish provides any promise or guarantee of access to or use of our services, excepting
   4. Certain access rights and similar as have been and are explicitly stated such as for our directors to access systems as needed to inspect them, and
   5. We may change or otherwise terminate any part of our service at any time and without prior notice, and
2. We may at our sole option require tenants to reapply or otherwise re-request our services, for example related to a change in our policies or services, and
3. Notwithstanding our policies and procedures and otherwise process due as expressly stated herein, the decisions of our volunteers are final, however
4. These and other policies may be amended in the form of procedures, while
   1. Each procedure may grant new or additional authority and obligations to/for our volunteers, and
   2. Each procedure except where expressly stated in related policy may increase but may not not decrease reporting or diligence requirements, and
   3. Each procedure may in no cases reduce the actual or effective authority or responsibility of our directors, and
   4. Each procedures is be uniquely named and listed in and among our policies and cataloged in a section of this document for this purpose, and
   5. Each procedure is effective once added/updated in the public repository where we maintain this policy, and
   6. Each procedure remains in effect until objected to by a director or modified, removed, or supplanted by a subsequent update, and
   7. Each change to procedure is reported to our secretary just as for other types of change such as to our policies, described above.
* OUR PROCEDURES

#+BEGIN_QUOTE
I told you that, so I could tell you this.
#+END_QUOTE

