README.html

<div id="outline-container-orga1f9f7b" class="outline-3">
<h3 id="orga1f9f7b"><span class="section-number-3">1.7</span> Our Approach to Our Work ("Terms of Service", "Terms of Authority") Policy</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org451fc03" class="outline-4">
<h4 id="org451fc03"><span class="section-number-4">1.7.1</span> SUMMARY</h4>
<div class="outline-text-4" id="text-1-7-1">
<blockquote>
<p>
Who washes the mirror of the had that watches itself?
</p>
</blockquote>
<p>
Overall:
</p>

<p>
Any service we may provide is offered AS-IS, without warranty (such as of workmanship or fitness to/for purpose) expressed or implied.  In most cases, services including such any and all access we may provide (including to our own volunteers) is provided at each users own risk, at and per our discretion.  In limited circumstances, certain of our staff may have rights and obligations specifically set forth in our policy (for example, to complete or verify self-auditing or related reporting requirements), and in these cases we may generally unable to deny access to certain systems to specific individuals named in this, or other of our policies or, in some limited cases, specific individuals named within our procedures.
</p>

<p>
In fact, the section may specify some of the above only in outline, for example to more or less strictly influence/establish parameters for our procedures, as may follow our policies,  which we hope we more easily and flexibly change as suit our work-style and preferences, and to make these sorts of internal changes without need to generally engage the board other than a via certain minimum reporting/disclosure specified in and by ITEMS below or by our other policies and procedures.
</p>
</div>
</div>
<div id="outline-container-org28dc234" class="outline-4">
<h4 id="org28dc234"><span class="section-number-4">1.7.2</span> ITEMS</h4>
<div class="outline-text-4" id="text-1-7-2">
<ol class="org-ol">
<li>At our sole pleasure and convenience we do and may grant or provide any and all products and/or service ("our services"), and as such each
<ol class="org-ol">
<li>May or can be accessed or used only per our own terms ("terms of service", "ToS", "end user agreement", "agreement", "this agreement"), including
<ol class="org-ol">
<li>our (Fosshost's, these) policies, procedures, and sometimes including</li>
<li>such items as may materially related among our vital records, and also always including</li>
</ol></li>
<li>This agreement which constitute or terms of use is subject to change at our sole discretion and without prior notice or warning, however
<ol class="org-ol">
<li>We carefully consider any change proposed, including to this and other of our policies, and
<ol class="org-ol">
<li>when a proposed change is found by our volunteers to have been put forward in good faith, and then shall</li>
<li>each proposed change be then reported to our secretary, and
<ol class="org-ol">
<li>such reports may be made in summary or some raw form per convenience, however</li>
<li>the specific intention of the change must be clearly stated, and</li>
<li>periodically we shall further report on the responses of the board, and</li>
<li>These and any similar reports may contain or intermix our views, including</li>
<li>The views of our volunteers and directors, etc. representatives may be considered</li>
<li>With or without consideration of other factors except</li>
<li>As specifically as we have agreed, for example by accepting these polices as our Terms and Conditions.</li>
</ol></li>
</ol></li>
<li>We similarly also carefully consider and periodically may review information submitted to us, for example such as
<ol class="org-ol">
<li>application for hosting, and/or</li>
<li>new applying tenant/project, and/or</li>
<li>technology as for employment in our network or otherwise use by our volunteers or tenants, and/or</li>
<li>volunteer who offers to help us, and/or</li>
<li>donation whether financial, of hardware, or software, or by discount, etc., and then</li>
<li>we may retain some information from these and/or otherwise refer or excerpt for our records, and</li>
</ol></li>
<li>Sometimes personal or otherwise sensitive information is included with or referenced by internal reporting.</li>
<li>We may at our sole discretion elect to withdraw some or all or any service we have provided, and
<ol class="org-ol">
<li>we shall report on each invocation of this discretion similarly as for a proposed change to our policies.</li>
</ol></li>
<li>We may generally, and except as otherwise stated within our policies or procedures delete or remove at will ("remove", "delete")
<ol class="org-ol">
<li>so we may delete at any time any log or other implicit intermediary file or dataset we do not require, or</li>
<li>so we may elect to retain or use others not specifically assigned/ascribed by us, e.g. for tenant use, and</li>
<li>so we may delete any other file not so similarly needed or owned after some period of time, and</li>
<li>although we may notify or attempt to notify tenants of our intention to delete information which may belong to them, however</li>
<li>we make no implicit promise or guarantee to keep or store information for anyone apart from our own vital records, and</li>
</ol></li>
</ol></li>
<li>No part of these terms or our policies or other information that we may publish provides any promise or guarantee of access to or use of our services, excepting</li>
<li>Certain access rights and similar as have been and are explicitly stated such as for our directors to access systems as needed to inspect them, and</li>
<li>We may change or otherwise terminate any part of our service at any time and without prior notice, and</li>
</ol></li>
<li>We may at our sole option require tenants to reapply or otherwise re-request our services, for example related to a change in our policies or services, and</li>
<li>Notwithstanding our policies and procedures and otherwise process due as expressly stated herein, the decisions of our volunteers are final, however</li>
<li>These and other policies may be amended in the form of procedures, while
<ol class="org-ol">
<li>Each procedure may grant new or additional authority and obligations to/for our volunteers, and</li>
<li>Each procedure except where expressly stated in related policy may increase but may not not decrease reporting or diligence requirements, and</li>
<li>Each procedure may in no cases reduce the actual or effective authority or responsibility of our directors, and</li>
<li>Each procedures is be uniquely named and listed in and among our policies and cataloged in a section of this document for this purpose, and</li>
<li>Each procedure is effective once added/updated in the public repository where we maintain this policy, and</li>
<li>Each procedure remains in effect until objected to by a director or modified, removed, or supplanted by a subsequent update, and</li>
<li>Each change to procedure is reported to our secretary just as for other types of change such as to our policies, described above.</li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb12b70f" class="outline-2">
<h2 id="orgb12b70f"><span class="section-number-2">2</span> OUR PROCEDURES</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
I told you that, so I could tell you this.
</p>
</blockquote>
</div>
