README.org
** SUMMARY
    The PROCEDURES following define our customary and typical operating procedures, or help to further define those procedures we wish to put into place.

Each provides or may eventually replace the complete work within the specific and narrow scope set forth, and thus may to some specific extent and within an increasingly better (in terms of more concretely and more specifically and technically expressed) and more narrow means and purpose, contribute to our means by which we govern our organization or help to influence or direct our activities.  Each is presently, or as we intend it to be, describing a gradually more specific and technical process in terms of sequence of steps, their meaning and consequence to our activities, their reliance publicly or to or without or community, and as toward eventually, as fully and completely as we may find necessary, to document always our intentional means including our regular operating activities and procedures.

Otherwise, the ITEMS below describe delegations of and not conference of authorities, creating a concept of "effective authority".  This enables volunteers to function with the full authority given they are operating within the specific bounds of our procedures.  By enabling those within our organization to act on and for our behalf, volunteers seek to grant each other and themselves a limited set of the wide latitude of authorities granted to our per our articles and policies as above, and in exchange they agree to the same limitations and conditions in the form of the exceptions set forth here above and below. No part of this document, including any ITEM below nor inclusion by reference of some or any other items or references be as limiting the responsibilities of Fosshost, nor any director with respect to our articles or else such policy as may be written above nor first or above in the below considering that version last accepted by all directors of record.

NOTE: In fact, the Fosshost board might be considered as the four individuals in terms of those who secure the liability shield under which we operate, however it is the mutual desire of all of the directors that we have and do operate for all intents and purposes such that Fosshost CTO Nate Sales can and does act as a fifth manager and director within our organization, including fully participating as per only his own inclination and availability to act, and continue to act as an equal member of our body, being the Fosshost board.  Generally, and absent any request he may have or in the future make, we  do afford him any rights and privileges otherwise due a member of our board.  Finally, our effective leader is Thomas Markee, our CEO and Founder.  All of the directors are confident in Thomas' leadership and pleased to support his direction for our future and the future of the FOSS movement.  These articles/procedures/policies are intended to delegate but do not in any way limit or otherwise undertake to change specifically or generally his authority over the Fosshost project, organization, nor any related assets or information as we may possess or control.

** ABSTRACT
*** Writing and Updating Procedure                                :PROCEDURE:

 For each procedure ("ITEM"), write a sub-section, describing a sequence of steps to arrive a specific goal, such as making a decision.

 Ultimately, our complete set of procedures must implement and verify that we implement each of the "controls" set forward in the policies, above.  For example, giving us a clear set of steps to follow to record an "exception", etc.  Thus, each of these further processes may serve to clarify use these terms is instruments of policy and practice, as well as how they work to demonstrate, or otherwise truthfully measure, the value of our work and the public good done thereby.

 It may help considering how much to include from of/from:
  * a specific practice, why and how to do it, and how that is working out for us, including
    * a clear description of the procedure in terms of how complete it is,
      * Design - it has been added to this document and not otherwise removed subsequent to any other article or procedure.
      * Adoption - it has been sponsored or forwarded by rule for further consideration up to and including a specific date and time when it shall become effective
      * Implementation - it is our effective and binding policy now and we may report on our compliance with it
      * Satisfaction - in any cases where not otherwise removed subsequent to other article or procedure, feedback is welcome.
    * for new things, the specific path or course of action proscribed, who's affected, their feelings and concerns
    * discussing/raising known and routine exceptions to other policy, if any
    * a description of how this may or should influence our network and services, and
    * any accepted understanding or theory you may have as to how our partners such as tenants or sponsors are, would be, or may be affected, and
  * include complete step-by-step technical and specific means to follow each step, whatever possible focusing first on
    * end-users (who may be trying to learn new things volunteering with us)
    * or developers (who may be trying to get something we need working)
    * And generally focusing on human facing detail (so that people can understand what we are doing, how we are doing it, and why).
  * and without fear of judgment or reprisal
    * provide only much of these as you are reasonably able. e.g., with a give commit/PR/hunk-of-your-time/etc.
    * frankly set forth alternatives in terms of and/or contrasted with our stated and aligned objectives
    * and at your own level of skill/language proficiency/etc. as best your are able and have time
  * and may create or establish roles
    * in the from of such and specific person or persons with our organization and including our partners and community, and
    * given and by generally mutual acknowledgement and consent, or
    * by specific delegation by policy or procedure, and in either case
    * when and as the directors shall agree and the secretary so record.

*** Preventing and Reporting Abuse                                :PROCEDURE:

**** SUMMARY

 We neither tolerate nor countenance any abuse nor excuse ourselves from consider and duly documenting each concern or potential concern in this regard.  This procedures outlines a process for that however it should not be to constrain or discourage you from other and further acts not described here and outside of the scope of preview of Fosshost.  It would and does otherwise belong to you and/as with to each of us, to report duly and as we see fit should be become aware of any serious abuse.

