README.org
**** ITEM

 1. Abuse is, generally, unwanted personal contact and/or conduct and/or misuse of our resources, verify that we are discussing one of these items before proceeding.
    1. In case of personal abuse
       1. Please notify any director and/or duty personnel as you most feel comfortable.
       2. You may also create a ticket in any such system as you feel most comfortable (for example it would be fine to send an email to support@fosshost.org, for this), or
       3. You may email or otherwise reach out to any other volunteer whom you feel comfortable speaking with, and
       4. Any of us are glad to help you discretely create an incident report.
	  1. And once the director of our operations becomes aware of the incident report which describes or otherwise alleges abuse, then we
	     1. shall (or shall assign among our volunteers to) review and research the complaint, who
	     2. may make immediate changes to our procedures as may be expressly needed to prevent or discover further abuse, and
	     3. may and shall make a full and detailed report and deliver it personally to our secretary, or to all directors, and
	     4. which secretary shall directly inform the board generally that a report was received, unless to do so may be inconsistent with complete and fair review, and
	     5. which the baord presented with a substantiated shall review and comment taking or expressly declining to take the recommended actions, and otherwise
	     6. shall inform the board once any finding is closed/terminated whether or not any action was taken or is recommended to be taken, and
	     7. the board shall occasionally report on such incidents as and how the secretary shall choose.
	  2. personal information may and should be omited or redacted from summary and other reporting measures as described here, however
	  3. personal information may and should be included if some actions required of or recommended to the directors may require it.
    2. In case of network abuse or otherwise abuse of our resources
       1. Follow generally the procedure for personal abuse, however
       2. Other more specific and detailed procedures which follow may direct additional and more specific assignment and reporting.

*** Information Handling                                          :PROCEDURE:
**** SUMMARY
     Most if not all of our volunteers routinely handle sensitive as well as non-sensitive information.

     This procedure gives the sequence of steps and controls invoked when we handle internal use information, including materials of unknown sensitivity.

