README.html

<li><a id="orgd36c0f7"></a>ITEM<br />
<div class="outline-text-5" id="text-2-2-2-2">
<ol class="org-ol">
<li>Abuse is, generally, unwanted personal contact and/or conduct and/or misuse of our resources, verify that we are discussing one of these items before proceeding.
<ol class="org-ol">
<li>In case of personal abuse
<ol class="org-ol">
<li>Please notify any director and/or duty personnel as you most feel comfortable.</li>
<li>You may also create a ticket in any such system as you feel most comfortable (for example it would be fine to send an email to support@fosshost.org, for this), or</li>
<li>You may email or otherwise reach out to any other volunteer whom you feel comfortable speaking with, and</li>
<li>Any of us are glad to help you discretely create an incident report.
<ol class="org-ol">
<li>And once the director of our operations becomes aware of the incident report which describes or otherwise alleges abuse, then we
<ol class="org-ol">
<li>shall (or shall assign among our volunteers to) review and research the complaint, who</li>
<li>may make immediate changes to our procedures as may be expressly needed to prevent or discover further abuse, and</li>
<li>may and shall make a full and detailed report and deliver it personally to our secretary, or to all directors, and</li>
<li>which secretary shall directly inform the board generally that a report was received, unless to do so may be inconsistent with complete and fair review, and</li>
<li>which the baord presented with a substantiated shall review and comment taking or expressly declining to take the recommended actions, and otherwise</li>
<li>shall inform the board once any finding is closed/terminated whether or not any action was taken or is recommended to be taken, and</li>
<li>the board shall occasionally report on such incidents as and how the secretary shall choose.</li>
</ol></li>
<li>personal information may and should be omited or redacted from summary and other reporting measures as described here, however</li>
<li>personal information may and should be included if some actions required of or recommended to the directors may require it.</li>
</ol></li>
</ol></li>
<li>In case of network abuse or otherwise abuse of our resources
<ol class="org-ol">
<li>Follow generally the procedure for personal abuse, however</li>
<li>Other more specific and detailed procedures which follow may direct additional and more specific assignment and reporting.</li>
</ol></li>
</ol></li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2294a78" class="outline-4">
<h4 id="org2294a78"><span class="section-number-4">2.2.3</span> Information Handling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<ol class="org-ol">
<li><a id="orgd24315d"></a>SUMMARY<br />
<div class="outline-text-5" id="text-2-2-3-1">
<p>
Most if not all of our volunteers routinely handle sensitive as well as non-sensitive information.
</p>

<p>
This procedure gives the sequence of steps and controls invoked when we handle internal use information, including materials of unknown sensitivity.
</p>
</div>
</li>
