README.org
**** ITEMS
     1. Information we by necessary retain or intend to retain irrespective of the length of time involved is, when not otherwise classified, considered internal-use, and
	1. Our secretary shall individually or by delegation be the sole conduit or otherwise approver when we release internal use information, however
	   1. Additional procedural items may further designate other channels lead to their more general release of some internal use information, however and when given
	   2. These and any additionally provided policies each shall
	      1. require explicit acknowledgement and prior alignment from or on the part of secretary, and then
	      2. additional policy may provide that another director or a specific and individually named agent acting on behalf of a director ("director or deputy director")
	      3. Who shall always in a routinely timely fashion so notify the secretary and other directors of each creation or modification of such a procedure, and
	2. Activity that includes classification or reclassification or publishing of internal use information may trigger additional handling and reporting requirements, and
	   1. Information may be handled differently according to each system where it is stored and accessed ("retained"), including
	      1. Information that constitutes or composes or vial records shall be retained only in the systems or catalogs expressly for each such record, and
	      2. Information systems must be expressly named and referenced in these policies and our other procedures following, and
	      3. Each so named and referenced information system must be stated to contain no vital records or as to what vital records are contained, and
	      4. Our procedures may require or otherwise case personally identify and other internal use information to appear in our vital records, and
		 1. Where such sensitive internal use information may appear in our vital records in each case the secretary has reported a specific need for this, or
		 2. That specific need and matter of practice is referenced in policy as well as set forth in procedure and thus made regular and routine, and
	   2. Internal use information may be retained in others systems of more general use for other or general proposes, but only when
	      1. Any vital record thus created is then transmitted to a system expressed used to access and retain such records, and
		 1. Such record whether in whole or in summary provides clear references as necessary to trace information between systems, and
		 2. The secretary shall regularly in summary report on each such system including
		    1. Making clear all purposes purpose and current or planned and intended uses of each such system, and
		    2. Making clear or otherwise directly referencing the licensing terms of each such system, and
		    3. Making clear the general information and all of the most sensitive information classifications known to be retained in each such system, and
		    4. Making clear the degree to which all appropriate uses we plan to identify referencing each such system is stated in our policies and procedures, and
		    5. Making clear the degree to which all appropriate access controls related to each such system are stated and met per our policies and procedures, and
		    6. Making clear any known or anticipated risks or reliant volatility (for example security issues) related to each such system, and
		    7. Naming an individual (who shall have been named already for other purposes in our policies and procedures) as being the custodian of the system, and
	      2. Otherwise final record may (unless otherwise noted such as in some specific procedure) be transmitted by email, by sending
		 1. An email message created explicitly to meet the purpose of this procedure, and
		 2. containing all complete and detail information needed to create the necessary record, and
		 3. when such message sent to our support email address ~support@fosshost.org~ or similar system.
	3. Routine uses of internal use information including initial classification processes are not reported, unless
	   1. when probably of publication by Fosshost appears to exist, routine use is reportable as when the secretary or other directors call for such reporting, and
	   2. always when inadvertent publication has occurred or in the event of reclassification having higher secrecy after publication than before/during, and
	   3. always also when in the course of investigating any report or suspicion of misuse or intentional misclassification of information by us, and
	4. We will generally try to contact you anytime we believe we may have released information that could be sensitive to you, and
	5. We may not report all use of information as may relate to you even when releasing externally, for example by request of law enforcement, and
	6. We reserve the right generally to reference FOSS projects which are our tenants on our websites and other promotional and similar public materials, and
	7. We otherwise do not share information except when compelled or at and by our sole discretion, thus
	   1. notwithstanding that we may share information based on the expressed and duly recorded written order of one of our directors, except whereas
	   2. we have started the parties and circumstances where we share information along with reasons and systems or means involved in our polices and procedures, then
	   3. we will usually not give any information to anyone or place it on any system for any reason not expressly stated by our policies and including our procedures.
     2. We shall log or record among our vital records all such systems as routinely we use to contain internal use information, and
     3.

*** Risk and Control                                              :PROCEDURE:
**** SUMMARY
 This procedure explains how to report risks to us and describes how we manage risk internally.

**** ITEMS

*** Limited General Representation                                :PROCEDURE:
**** Limited Due Diligence                                        :PROCEDURE:
***** SUMMARY
 Where as some diligence may be requisite in following these procedures and making the records called for therein; however, (and notwithstanding our own training, certification, documentation, and related materials including our policies and procedures), our volunteers may have little or no specific expertise or training or otherwise certification even as may regard some or all of their specific and routine duties or other work for Fosshost.  Thus all service and support are "AS-IS" being best effort of individuals acting in good faith and no more can we offer or provide.

***** ITEMS
**** Limited Liability                                            :PROCEDURE:
***** SUMMARY
 Whereas the volunteers comprising Fosshost are all individuals acting in good faith, the liability protections afforded to the organization by virtue of its CIC registration shall apply to each of them.

***** ITEMS
**** Limited Delegation                                           :PROCEDURE:
