README.html

<li><a id="orgbbdbea1"></a>ITEMS<br />
<div class="outline-text-5" id="text-2-2-3-2">
<ol class="org-ol">
<li>Information we by necessary retain or intend to retain irrespective of the length of time involved is, when not otherwise classified, considered internal-use, and
<ol class="org-ol">
<li>Our secretary shall individually or by delegation be the sole conduit or otherwise approver when we release internal use information, however
<ol class="org-ol">
<li>Additional procedural items may further designate other channels lead to their more general release of some internal use information, however and when given</li>
<li>These and any additionally provided policies each shall
<ol class="org-ol">
<li>require explicit acknowledgement and prior alignment from or on the part of secretary, and then</li>
<li>additional policy may provide that another director or a specific and individually named agent acting on behalf of a director ("director or deputy director")</li>
<li>Who shall always in a routinely timely fashion so notify the secretary and other directors of each creation or modification of such a procedure, and</li>
</ol></li>
</ol></li>
<li>Activity that includes classification or reclassification or publishing of internal use information may trigger additional handling and reporting requirements, and
<ol class="org-ol">
<li>Information may be handled differently according to each system where it is stored and accessed ("retained"), including
<ol class="org-ol">
<li>Information that constitutes or composes or vial records shall be retained only in the systems or catalogs expressly for each such record, and</li>
<li>Information systems must be expressly named and referenced in these policies and our other procedures following, and</li>
<li>Each so named and referenced information system must be stated to contain no vital records or as to what vital records are contained, and</li>
<li>Our procedures may require or otherwise case personally identify and other internal use information to appear in our vital records, and
<ol class="org-ol">
<li>Where such sensitive internal use information may appear in our vital records in each case the secretary has reported a specific need for this, or</li>
<li>That specific need and matter of practice is referenced in policy as well as set forth in procedure and thus made regular and routine, and</li>
</ol></li>
</ol></li>
<li>Internal use information may be retained in others systems of more general use for other or general proposes, but only when
<ol class="org-ol">
<li>Any vital record thus created is then transmitted to a system expressed used to access and retain such records, and
<ol class="org-ol">
<li>Such record whether in whole or in summary provides clear references as necessary to trace information between systems, and</li>
<li>The secretary shall regularly in summary report on each such system including
<ol class="org-ol">
<li>Making clear all purposes purpose and current or planned and intended uses of each such system, and</li>
<li>Making clear or otherwise directly referencing the licensing terms of each such system, and</li>
<li>Making clear the general information and all of the most sensitive information classifications known to be retained in each such system, and</li>
<li>Making clear the degree to which all appropriate uses we plan to identify referencing each such system is stated in our policies and procedures, and</li>
<li>Making clear the degree to which all appropriate access controls related to each such system are stated and met per our policies and procedures, and</li>
<li>Making clear any known or anticipated risks or reliant volatility (for example security issues) related to each such system, and</li>
<li>Naming an individual (who shall have been named already for other purposes in our policies and procedures) as being the custodian of the system, and</li>
</ol></li>
</ol></li>
<li>Otherwise final record may (unless otherwise noted such as in some specific procedure) be transmitted by email, by sending
<ol class="org-ol">
<li>An email message created explicitly to meet the purpose of this procedure, and</li>
<li>containing all complete and detail information needed to create the necessary record, and</li>
<li>when such message sent to our support email address <code>support@fosshost.org</code> or similar system.</li>
</ol></li>
</ol></li>
</ol></li>
<li>Routine uses of internal use information including initial classification processes are not reported, unless
<ol class="org-ol">
<li>when probably of publication by Fosshost appears to exist, routine use is reportable as when the secretary or other directors call for such reporting, and</li>
<li>always when inadvertent publication has occurred or in the event of reclassification having higher secrecy after publication than before/during, and</li>
<li>always also when in the course of investigating any report or suspicion of misuse or intentional misclassification of information by us, and</li>
</ol></li>
<li>We will generally try to contact you anytime we believe we may have released information that could be sensitive to you, and</li>
<li>We may not report all use of information as may relate to you even when releasing externally, for example by request of law enforcement, and</li>
<li>We reserve the right generally to reference FOSS projects which are our tenants on our websites and other promotional and similar public materials, and</li>
<li>We otherwise do not share information except when compelled or at and by our sole discretion, thus
<ol class="org-ol">
<li>notwithstanding that we may share information based on the expressed and duly recorded written order of one of our directors, except whereas</li>
<li>we have started the parties and circumstances where we share information along with reasons and systems or means involved in our polices and procedures, then</li>
<li>we will usually not give any information to anyone or place it on any system for any reason not expressly stated by our policies and including our procedures.</li>
</ol></li>
</ol></li>
<li>We shall log or record among our vital records all such systems as routinely we use to contain internal use information, and</li>
<li></li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgd0f925f" class="outline-4">
<h4 id="orgd0f925f"><span class="section-number-4">2.2.4</span> Risk and Control&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-4">
</div>
<ol class="org-ol">
<li><a id="org68343c7"></a>SUMMARY<br />
<div class="outline-text-5" id="text-2-2-4-1">
<p>
This procedure explains how to report risks to us and describes how we manage risk internally.
</p>
</div>
</li>

<li><a id="org43582ee"></a>ITEMS<br /></li>
</ol>
</div>

<div id="outline-container-org6fcaddb" class="outline-4">
<h4 id="org6fcaddb"><span class="section-number-4">2.2.5</span> Limited General Representation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-5">
</div>
<ol class="org-ol">
<li><a id="org3ef7b06"></a>Limited Due Diligence&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span><br />
<ol class="org-ol">
<li><a id="org1458868"></a>SUMMARY<br />
<div class="outline-text-6" id="text-2-2-5-1-1">
<p>
Where as some diligence may be requisite in following these procedures and making the records called for therein; however, (and notwithstanding our own training, certification, documentation, and related materials including our policies and procedures), our volunteers may have little or no specific expertise or training or otherwise certification even as may regard some or all of their specific and routine duties or other work for Fosshost.  Thus all service and support are "AS-IS" being best effort of individuals acting in good faith and no more can we offer or provide.
</p>
</div>
</li>

<li><a id="org4002ffe"></a>ITEMS<br /></li>
</ol>
</li>
<li><a id="org7913ebc"></a>Limited Liability&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span><br />
<ol class="org-ol">
<li><a id="org8c9e02f"></a>SUMMARY<br />
<div class="outline-text-6" id="text-2-2-5-2-1">
<p>
Whereas the volunteers comprising Fosshost are all individuals acting in good faith, the liability protections afforded to the organization by virtue of its CIC registration shall apply to each of them.
</p>
</div>
</li>

<li><a id="org70bc74e"></a>ITEMS<br /></li>
</ol>
</li>
<li><a id="org0ea3a7f"></a>Limited Delegation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span><br />
<ol class="org-ol">
