README.org
***** SUMMARY
 Whereas the volunteers comprising Fosshost are all well known to and trusted by each other, general authority shall often be vested in and between them, and while our best efforts to retain true and complete records will certify in some cases our director or other person of note, it may at times be some or several parties within or organization acting under the authority of our named and reporting representative, and in case where summary report shall be sufficient for our purposes (such as to detect and prevent misuse of our resources), no further record according given acts more directly may eventually be kept.

***** ITEMS
*** Exceptional Circumstance                                      :PROCEDURE:
**** SUMMARY
 In exceptional circumstances, the volunteer or volunteers directly involved in a crisis have additional authority and responsibility.

**** ITEMS

*** Customary Authority                                           :PROCEDURE:
**** Routine Changes                                              :PROCEDURE:
***** SUMMARY
 In most routine circumstances, the operations director (or delegate) will review and summarily schedule and approve changes, logging such actions for the secretary to report to the board.  For some case where it may be necessary, we also provide for a an hierarchical decision making structure.  This generally serves to give our Chief Executive Officer or other directors the ability to intercept and redirect contentious decisions, and bring them before our board for consideration.  Absent contention, or specific intervention from our CEO, it places most complicated decision making authority with our Chief Technology Officer.   It also provides that the director will usually have specific criteria (stated in other procedures) for when rejecting/declining to schedule a given change.
***** ITEMS
 1. The duty director of operations has the initial right of approval for all non-emergency changes
    1. There is always a director of operations on duty
    2. When no person has been so assigned, that person is the deputy director of operations (Hope Christensen, DDO)
    3. When the DDO is not available or otherwise declines, that person is the director in charge of operations (Corwin Brust, COO)
    4. When the COO or another director may disagree with the DDO we defer to our executive in chief (Thomas Markey, CEO), or
    5. When our CEO shall neither object nor direct the matter, then
    6. The view of the technical officer in chief (Nate Sales, CTO) shall prevail, unless or
    7. When the CTO does not object or direct the matter, then
    8. The majority of the board shall be recorded before such officers view or instruction may be set aside, however
    9. The duty director shall generally approve all changes unless they do not comply with
       1. These policies and procedures or otherwise, or articles, and/or
       2. The express stated wishes of one or several directors, and
       3. Should state a reason for rejecting the change, ideally in terms of one or several references to our procedures.
 2. Routine changes, such as to reassign IP addresses, etc. are made with the authority DDO and may be delegated.
 3. Changed deemed as projects (e.g having tenant impact, etc.) additionally require approval from our Head of Projects (Nik Anderson, HOP) prior to review by DDO.
 4. Further and other procedures may within a stated and narrow scope enable specific changes to be considered as routine, when and given
    1. Such procedure each (or by cooperation between several processes together) shall not circumvent the due notification of the offices of individuals here listed, and
    2. Such procedure which are new and/or changed each shall be placed before the board of the directors of fosshost
       1. initially before they may become effective, and
       2. periodically for review, however
       3. once effective each shall remain effective until replaced (as described in our policies) or objected to/removed by the board of the directors of Fosshost.

**** Emergency Maintenance                                        :PROCEDURE:
 1. The duty director of operations shall be notified of any emergency maintenance
    1. Notification shall be made to the directors within 24hrs after or within 2hrs during any emergency maintaince,
    2. And the secretary shall report to the directors and to board of the directors of Fosshost following such, and otherwise and after
 2. For the purpose of restoration of service emergency changes are summarily approved by the duty director upon completion of any otherwise required process.
*** Public Relations                                              :PROCEDURE:
 1. The volunteers who support our public relations effort may be and are often subject to information before others within our organization.
 2. In this work we routinely use other formats and/or systems and may store internal use information on those systems, which are not generally reported from.
 3. Neither fosshost nor any given volunteer can be responsible for loss or exposure of information due, for example, to a breach of such a system, except in case where otherwise fosshost or such volunteer would be a party such a breach, or other similar malfeasance.
*** Defining and Prioritizing Projects                            :PROCEDURE:
**** SUMMARY
 The alignment of the head of projects (Nik Anderson, HOP) or a specifically named delegate or a director of Fosshost shall be recorded, and some criteria are suggested.
**** ITEMS
 1. The HOP shall generally forward for scheduling of implementation ("approve"), each project which
    1. Has a clearly stated direct value to our tenants, volunteers, and/or community, and
    2. Aligns and supports our process and/or includes the required changes updating them along with delivery/completion of the project, and
    3. Provides a warranty of intention to support by specific individuals where general understanding may not yet exist within our team, and
 2. The HOP also shall generally decline to forward ("reject"), each project which
    1. Conflicts or appears to conflict with or circumvent or otherwise avoid the reporting or information handling or otherwise our policies and procedures, or which
    2. Conflicts with a specific and direct written order from a director or from the board of our directors, or which
    3. Is generally or appears seriously disliked or not well understood by the team, e.g. our volunteers.

*** Scheduling Criteria                                           :PROCEDURE:
