README.html
<li><a id="orgec0dd40"></a>SUMMARY<br />
<div class="outline-text-6" id="text-2-2-5-3-1">
<p>
Whereas the volunteers comprising Fosshost are all well known to and trusted by each other, general authority shall often be vested in and between them, and while our best efforts to retain true and complete records will certify in some cases our director or other person of note, it may at times be some or several parties within or organization acting under the authority of our named and reporting representative, and in case where summary report shall be sufficient for our purposes (such as to detect and prevent misuse of our resources), no further record according given acts more directly may eventually be kept.
</p>
</div>
</li>

<li><a id="org6f77bcc"></a>ITEMS<br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgdb15c4b" class="outline-4">
<h4 id="orgdb15c4b"><span class="section-number-4">2.2.6</span> Exceptional Circumstance&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-6">
</div>
<ol class="org-ol">
<li><a id="org52d5ada"></a>SUMMARY<br />
<div class="outline-text-5" id="text-2-2-6-1">
<p>
In exceptional circumstances, the volunteer or volunteers directly involved in a crisis have additional authority and responsibility.
</p>
</div>
</li>

<li><a id="org0c0b15c"></a>ITEMS<br /></li>
</ol>
</div>

<div id="outline-container-orgad5714c" class="outline-4">
<h4 id="orgad5714c"><span class="section-number-4">2.2.7</span> Customary Authority&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-7">
</div>
<ol class="org-ol">
<li><a id="org096742c"></a>Routine Changes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span><br />
<ol class="org-ol">
<li><a id="orga3107cf"></a>SUMMARY<br />
<div class="outline-text-6" id="text-2-2-7-1-1">
<p>
In most routine circumstances, the operations director (or delegate) will review and summarily schedule and approve changes, logging such actions for the secretary to report to the board.  For some case where it may be necessary, we also provide for a an hierarchical decision making structure.  This generally serves to give our Chief Executive Officer or other directors the ability to intercept and redirect contentious decisions, and bring them before our board for consideration.  Absent contention, or specific intervention from our CEO, it places most complicated decision making authority with our Chief Technology Officer.   It also provides that the director will usually have specific criteria (stated in other procedures) for when rejecting/declining to schedule a given change.
</p>
</div>
</li>
<li><a id="org6b55c17"></a>ITEMS<br />
<div class="outline-text-6" id="text-2-2-7-1-2">
<ol class="org-ol">
<li>The duty director of operations has the initial right of approval for all non-emergency changes
<ol class="org-ol">
<li>There is always a director of operations on duty</li>
<li>When no person has been so assigned, that person is the deputy director of operations (Hope Christensen, DDO)</li>
<li>When the DDO is not available or otherwise declines, that person is the director in charge of operations (Corwin Brust, COO)</li>
<li>When the COO or another director may disagree with the DDO we defer to our executive in chief (Thomas Markey, CEO), or</li>
<li>When our CEO shall neither object nor direct the matter, then</li>
<li>The view of the technical officer in chief (Nate Sales, CTO) shall prevail, unless or</li>
<li>When the CTO does not object or direct the matter, then</li>
<li>The majority of the board shall be recorded before such officers view or instruction may be set aside, however</li>
<li>The duty director shall generally approve all changes unless they do not comply with
<ol class="org-ol">
<li>These policies and procedures or otherwise, or articles, and/or</li>
<li>The express stated wishes of one or several directors, and</li>
<li>Should state a reason for rejecting the change, ideally in terms of one or several references to our procedures.</li>
</ol></li>
</ol></li>
<li>Routine changes, such as to reassign IP addresses, etc. are made with the authority DDO and may be delegated.</li>
<li>Changed deemed as projects (e.g having tenant impact, etc.) additionally require approval from our Head of Projects (Nik Anderson, HOP) prior to review by DDO.</li>
<li>Further and other procedures may within a stated and narrow scope enable specific changes to be considered as routine, when and given
<ol class="org-ol">
<li>Such procedure each (or by cooperation between several processes together) shall not circumvent the due notification of the offices of individuals here listed, and</li>
<li>Such procedure which are new and/or changed each shall be placed before the board of the directors of fosshost
<ol class="org-ol">
<li>initially before they may become effective, and</li>
<li>periodically for review, however</li>
<li>once effective each shall remain effective until replaced (as described in our policies) or objected to/removed by the board of the directors of Fosshost.</li>
</ol></li>
</ol></li>
</ol>
</div>
</li>
</ol>
</li>

<li><a id="org610e9c8"></a>Emergency Maintenance&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span><br />
<div class="outline-text-5" id="text-2-2-7-2">
<ol class="org-ol">
<li>The duty director of operations shall be notified of any emergency maintenance
<ol class="org-ol">
<li>Notification shall be made to the directors within 24hrs after or within 2hrs during any emergency maintaince,</li>
<li>And the secretary shall report to the directors and to board of the directors of Fosshost following such, and otherwise and after</li>
</ol></li>
<li>For the purpose of restoration of service emergency changes are summarily approved by the duty director upon completion of any otherwise required process.</li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org8968091" class="outline-4">
<h4 id="org8968091"><span class="section-number-4">2.2.8</span> Public Relations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-8">
<ol class="org-ol">
<li>The volunteers who support our public relations effort may be and are often subject to information before others within our organization.</li>
<li>In this work we routinely use other formats and/or systems and may store internal use information on those systems, which are not generally reported from.</li>
<li>Neither fosshost nor any given volunteer can be responsible for loss or exposure of information due, for example, to a breach of such a system, except in case where otherwise fosshost or such volunteer would be a party such a breach, or other similar malfeasance.</li>
</ol>
</div>
</div>
<div id="outline-container-org27f1333" class="outline-4">
<h4 id="org27f1333"><span class="section-number-4">2.2.9</span> Defining and Prioritizing Projects&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-9">
</div>
<ol class="org-ol">
<li><a id="orgb4cb133"></a>SUMMARY<br />
<div class="outline-text-5" id="text-2-2-9-1">
<p>
The alignment of the head of projects (Nik Anderson, HOP) or a specifically named delegate or a director of Fosshost shall be recorded, and some criteria are suggested.
</p>
</div>
</li>
<li><a id="org7ae718b"></a>ITEMS<br />
<div class="outline-text-5" id="text-2-2-9-2">
<ol class="org-ol">
<li>The HOP shall generally forward for scheduling of implementation ("approve"), each project which
<ol class="org-ol">
<li>Has a clearly stated direct value to our tenants, volunteers, and/or community, and</li>
<li>Aligns and supports our process and/or includes the required changes updating them along with delivery/completion of the project, and</li>
<li>Provides a warranty of intention to support by specific individuals where general understanding may not yet exist within our team, and</li>
</ol></li>
<li>The HOP also shall generally decline to forward ("reject"), each project which
<ol class="org-ol">
<li>Conflicts or appears to conflict with or circumvent or otherwise avoid the reporting or information handling or otherwise our policies and procedures, or which</li>
<li>Conflicts with a specific and direct written order from a director or from the board of our directors, or which</li>
<li>Is generally or appears seriously disliked or not well understood by the team, e.g. our volunteers.</li>
</ol></li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-org1addfc4" class="outline-4">
<h4 id="org1addfc4"><span class="section-number-4">2.2.10</span> Scheduling Criteria&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-10">
</div>
<ol class="org-ol">
