README.org
**** SUMMARY
 Alignment from the duty director of operations (DDO, generally Deputy Director of Operations, Hope Christensen, or as delegated) is generally a formality based on circumstances, however planed changes to network (excluding work to and within test and development infrastructure of our own), come in two phases: Scheduling a change, when we consider it's readiness, and implementing the change, when we ensure no other complications appear to exist before we begin.  Scheduling can involve careful consideration, even learning how new technologies will interact with our network and our work supporting it.  Final change alignment is generally evident from circumstance.
**** ITEMS
 1. The DDO shall generally forward projects and schedule them for release when
    1. If they are projects, the HOPs alignment is noted, and
    2. When such public facing changes as may be required can and will be completed as part of the implementation, and
    3. When tenant impacts are known and verified, and
    4. At least two volunteers who are not the proponent of note, or one volunteer who is also a director, have reviewed and tested and otherwise aligned to the change, or
 2. The DDO shall generally decline to forward ("reject") when
    1. There is no clear proponent for a change, or
    2. A number of volunteers claim unfamiliarity including inability to freely access references, review configuration, etc., or
    3. When the change replaces something better documented especially as within our procedures, or
    4. When a director has in writing objected, or
    5. When directed by the board not to forward the change. or
    6. When otherwise finding the change may not be ready for release, and
    7. And upon so documenting and reporting shall reject the change generally without prejudice.
 3. The DDO shall generally implement and/or approve to implement ("approve") such changes as may be scheduled, except
    1. Upon finding an emergency change or otherwise significant network activity not anticipated for the change window, or
    2. When otherwise concerned, for example related to the stability or testing, or similar or other concerns, then
    3. The DDO shall revert the planned change once again for scheduling, and so report to the secretary and directors.

*** Technical Criteria                                            :PROCEDURE:
**** SUMMARY
 This procedures provides a generic process for cross-checking a given software change installation/configuration/reconfiguration is ready for scheduling.  In some cases individual ITEMS (and associated reporting, if any) may not apply.
**** ITEMS
 1. Testing  -
    1. Has the change been tested?
       1. YES: link to test results
       2. NO: verify director alignment
       3. NO TESTING POSSIBLE: If a 1:1 test is not possible, document anything we did to be confident the change is correct/will work as expected.
 2. Stakehoder Alignment
    1. N/A, change doesn't have significant stakeholders
    2. Pending change communication and notification planning
    3. Stakeholders communication is partially complete
       1. State any other communication/notification (when and any template for each) required
    4. All stakeholder communication was verified and/or has been included as part of the change plan.
    5. Should this change be considered for a future press release or blog post or other self-promotion?
 3. Technical Change Impact
    1. Public and Tenant Facing Documentation
       1. N/A, no such document is related to the change
       2. Included, all documentation updates are included as part of this change
       3. As instructed
	  1. State any documentation that should be updated (when and repo/process document for each)
       4. TBD, externally facing documentation impact is unknown
       5. Incremental, some related documentation is out of date now and will remain so after the change
    2. Are new technologies (e.g. programs, web-services, architectures, virtualization techniques, etc.) included with the change?
       1. If YES, for each, how many Fosshost volunteers understand the new tool/service/application well?
    3. Are any technologies or approaches retired or eventually replaced by this change?
       1. If YES, Describe any remaining work to retire/replace not completed by this change.
    4. Is our process and other critical internal documentation current with respect to this change?
       1. Operating Model (Procedures)?
       2. CMDB
       3. Blueprints (and/or Roadmaps)
    5. When will the change take place?
       1. When will it start?
       2. Planned duration?
       3. Does this include time for backup/testing/backout? (How much?)
*** Operational Logging
**** SUMMARY
 Fosshost keeps many logs and other similar records of and related to it's activities.  This procedure provides for two general types, one of which is used to provide the public account shared (initially) with directors on an on-going basis, and the other for internal non-reporting systems, which are generally accessible to more of our volunteers or used for other specific purposes.
