README.html
<li><a id="org90f7d79"></a>SUMMARY<br />
<div class="outline-text-5" id="text-2-2-10-1">
<p>
Alignment from the duty director of operations (DDO, generally Deputy Director of Operations, Hope Christensen, or as delegated) is generally a formality based on circumstances, however planed changes to network (excluding work to and within test and development infrastructure of our own), come in two phases: Scheduling a change, when we consider it's readiness, and implementing the change, when we ensure no other complications appear to exist before we begin.  Scheduling can involve careful consideration, even learning how new technologies will interact with our network and our work supporting it.  Final change alignment is generally evident from circumstance.
</p>
</div>
</li>
<li><a id="orgbde1d84"></a>ITEMS<br />
<div class="outline-text-5" id="text-2-2-10-2">
<ol class="org-ol">
<li>The DDO shall generally forward projects and schedule them for release when
<ol class="org-ol">
<li>If they are projects, the HOPs alignment is noted, and</li>
<li>When such public facing changes as may be required can and will be completed as part of the implementation, and</li>
<li>When tenant impacts are known and verified, and</li>
<li>At least two volunteers who are not the proponent of note, or one volunteer who is also a director, have reviewed and tested and otherwise aligned to the change, or</li>
</ol></li>
<li>The DDO shall generally decline to forward ("reject") when
<ol class="org-ol">
<li>There is no clear proponent for a change, or</li>
<li>A number of volunteers claim unfamiliarity including inability to freely access references, review configuration, etc., or</li>
<li>When the change replaces something better documented especially as within our procedures, or</li>
<li>When a director has in writing objected, or</li>
<li>When directed by the board not to forward the change. or</li>
<li>When otherwise finding the change may not be ready for release, and</li>
<li>And upon so documenting and reporting shall reject the change generally without prejudice.</li>
</ol></li>
<li>The DDO shall generally implement and/or approve to implement ("approve") such changes as may be scheduled, except
<ol class="org-ol">
<li>Upon finding an emergency change or otherwise significant network activity not anticipated for the change window, or</li>
<li>When otherwise concerned, for example related to the stability or testing, or similar or other concerns, then</li>
<li>The DDO shall revert the planned change once again for scheduling, and so report to the secretary and directors.</li>
</ol></li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga30b303" class="outline-4">
<h4 id="orga30b303"><span class="section-number-4">2.2.11</span> Technical Criteria&#xa0;&#xa0;&#xa0;<span class="tag"><span class="PROCEDURE">PROCEDURE</span></span></h4>
<div class="outline-text-4" id="text-2-2-11">
</div>
<ol class="org-ol">
<li><a id="orgbe97efe"></a>SUMMARY<br />
<div class="outline-text-5" id="text-2-2-11-1">
<p>
This procedures provides a generic process for cross-checking a given software change installation/configuration/reconfiguration is ready for scheduling.  In some cases individual ITEMS (and associated reporting, if any) may not apply.
</p>
</div>
</li>
<li><a id="org9c1e3c2"></a>ITEMS<br />
<div class="outline-text-5" id="text-2-2-11-2">
<ol class="org-ol">
<li>Testing  -
<ol class="org-ol">
<li>Has the change been tested?
<ol class="org-ol">
<li>YES: link to test results</li>
<li>NO: verify director alignment</li>
<li>NO TESTING POSSIBLE: If a 1:1 test is not possible, document anything we did to be confident the change is correct/will work as expected.</li>
</ol></li>
</ol></li>
<li>Stakehoder Alignment
<ol class="org-ol">
<li>N/A, change doesn't have significant stakeholders</li>
<li>Pending change communication and notification planning</li>
<li>Stakeholders communication is partially complete
<ol class="org-ol">
<li>State any other communication/notification (when and any template for each) required</li>
</ol></li>
<li>All stakeholder communication was verified and/or has been included as part of the change plan.</li>
<li>Should this change be considered for a future press release or blog post or other self-promotion?</li>
</ol></li>
<li>Technical Change Impact
<ol class="org-ol">
<li>Public and Tenant Facing Documentation
<ol class="org-ol">
<li>N/A, no such document is related to the change</li>
<li>Included, all documentation updates are included as part of this change</li>
<li>As instructed
<ol class="org-ol">
<li>State any documentation that should be updated (when and repo/process document for each)</li>
</ol></li>
<li>TBD, externally facing documentation impact is unknown</li>
<li>Incremental, some related documentation is out of date now and will remain so after the change</li>
</ol></li>
<li>Are new technologies (e.g. programs, web-services, architectures, virtualization techniques, etc.) included with the change?
<ol class="org-ol">
<li>If YES, for each, how many Fosshost volunteers understand the new tool/service/application well?</li>
</ol></li>
<li>Are any technologies or approaches retired or eventually replaced by this change?
<ol class="org-ol">
<li>If YES, Describe any remaining work to retire/replace not completed by this change.</li>
</ol></li>
<li>Is our process and other critical internal documentation current with respect to this change?
<ol class="org-ol">
<li>Operating Model (Procedures)?</li>
<li>CMDB</li>
<li>Blueprints (and/or Roadmaps)</li>
</ol></li>
<li>When will the change take place?
<ol class="org-ol">
<li>When will it start?</li>
<li>Planned duration?</li>
<li>Does this include time for backup/testing/backout? (How much?)</li>
</ol></li>
</ol></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org379142c" class="outline-4">
<h4 id="org379142c"><span class="section-number-4">2.2.12</span> Operational Logging</h4>
<div class="outline-text-4" id="text-2-2-12">
</div>
<ol class="org-ol">
<li><a id="org9c1a244"></a>SUMMARY<br />
<div class="outline-text-5" id="text-2-2-12-1">
<p>
Fosshost keeps many logs and other similar records of and related to it's activities.  This procedure provides for two general types, one of which is used to provide the public account shared (initially) with directors on an on-going basis, and the other for internal non-reporting systems, which are generally accessible to more of our volunteers or used for other specific purposes.
</p>
</div>
</li>
