README.org
**** ITEMS
 1. We shall maintain logs and other records until they are by policy or by order of the board removed, and
 2. We shall maintain separately and carefully any such records as may over a long period in time as with our vital records, and
 3. Some information and information systems may different requirements based on how we used them, including
    1. Systems used for reporting and vital records ("Reporting Systems"), which shall
       1. Contain, even when or by reference any and all such information, as
       2. for a director or other officer named by this or other of our policies, to
       3. review and report such and all related activties of the organization, as
       4. said officer or director shall control or otherwise have right to review on our behalf, given
       5. any and all technology and systems access and credentials needed are duly given, or otherwise
    2. Systems not used for reporting but otherwise used internally ("Non-Reporting Systems", "Other Internal Systems")
       1. May contain information that is non-reportable (such as internal and 3rd party communications), and
       2. May contain information that does not represent the views or position of Fosshost or our directors or other volunteers, and
       3. Officers or others requiring access (e.g. for example, officers named in this policy) that access shall be given as required, when
	  1. A given system is routinely referenced in Reporting Systems, or
	  2. Upon duly written request from any director, and otherwise
    3. We grant access to systems, including where that access may include the ability to delete or review logs, when
       1. A specific need exists for a person to access or routinely access a technology or system or systems, or
       2. When our policy or legal or other requirement compels us to do so, however
       3. We may at our digression follow other procedures, and
       4. Such other procedures may be
	  1. given below, for example by reference, among our procedures, or otherwise by
	  2. exception, duly recorded as described above and elsewhere herein, and
 4. Logs of any kind which serve no purpose may be removed/deleted
    1. at any time at our sole digression, however
    2. we perform such deletion or removal by default automated means in most cases, or otherwise
    3. such manual deletion of logs as we may order or detect may be recorded as a Planned Changed or Emergency Change, or is otherwise reported, thus
 5. Notwithstanding our officers and such rights and obligations as each may have (for example to inspect and otherwise audit Reporting Systems and those referenced),
    1. Access to any of our systems is a privilege, and
    2. May be revoked at any time, and
    3. with or without cause or any reason stated, and
    4. At our sole digression, but only given when
    5. You consent to these and other terms.
 6. Reporting Systems shall not directly store, but may reference incorporate, information
    1. Making or containing reference to a specific person not also referenced by that same name elsewhere in our policies and procedures, or
    2. Including or referencing communication not intended to/for Fosshost or otherwise not clearly related to our acitivites, or
    3. Making or containing reference to events not pertaining to the activities of Fosshost
 7. Non-Reporting Systems may and do store such information as may be required or convenient to and for our organization, however
    1. We regularly inventory, audit, and otherwise account for all of our internal systems, and
    2. Similarly, we do inventory, audit, and otherwise track access to all our internal systems,
    3. And we do report and consider as vital records all such inventories and audits and their findings.

** ADMINISTRATIVE

We intend to document or otherwise describe nearly all of our internal procedures, while some details may be redacted and/or stored in more private repositories, we try to provide clear parameters around what we cannot publish, and to publish as much detail would be prudent and courteous and not more.

The items in this section describe tasks which are generally administrative but may include or reference other (e.g. more technical or more general) procedures elsewhere described in more detail.  Additionally, some details such as specific system names, symbolic links, keys, or other identifiers other than the names of people may be removed, replaced with placeholders, obscured, or otherwise concealed in those versions of our policies and procedures such as we make available publicly or otherwise than for our own (otherwise unrestrained) internal and necessary use.

*** Keeping the Operations Log
*** Basic Ticketing
*** Requesting credentials
*** Reviewing Applications
*** On-boarding
**** Facilities
**** Other (Sponsors and Vendors)
*** Updating the Asset Catalog
*** Shipping and Receiving
*** Special Handling for Reimbursable Receipts
*** Accepting and Transferring Donations
*** Running Meetings
** TECHNICAL
*** Testing Your Credentials
*** AARCH64
**** AARCH64 Tenant Provisioning
**** AARCH64 Creating Clusters
**** AARCH64 Adding and Removing Nodes
**** AARCH64 Troubleshooting
*** General or x86 Specific
**** Tenant Provisioning
**** Credentials
***** Provision Tenant Credential
***** Provision Volunteer Credential
***** Removing Credentials
**** New or Changed or Replaced Nodes
***** Racking Hardware
***** Provisioning Hypervisors
***** Restoring or Replicating a Node
***** Pooled Disc Replacement
***** Adding SSD
***** Troubleshooting Hardware Node Installation and Change
**** Mirrors
***** Add a mirror
***** Remove a mirror
***** Mirrors Troubleshooting
**** Email and Web Hosting
***** Provision a domain/project
***** Remove a domain/project
***** Email and Web Troubleshooting
**** DNS
***** Domain Registration
***** Domain Renewal
***** Reverse DNS
***** DNS Troubleshooting
** OVERSIGHT
