README.html
<li><a id="orgcd7086f"></a>ITEMS<br />
<div class="outline-text-5" id="text-2-2-12-2">
<ol class="org-ol">
<li>We shall maintain logs and other records until they are by policy or by order of the board removed, and</li>
<li>We shall maintain separately and carefully any such records as may over a long period in time as with our vital records, and</li>
<li>Some information and information systems may different requirements based on how we used them, including
<ol class="org-ol">
<li>Systems used for reporting and vital records ("Reporting Systems"), which shall
<ol class="org-ol">
<li>Contain, even when or by reference any and all such information, as</li>
<li>for a director or other officer named by this or other of our policies, to</li>
<li>review and report such and all related activties of the organization, as</li>
<li>said officer or director shall control or otherwise have right to review on our behalf, given</li>
<li>any and all technology and systems access and credentials needed are duly given, or otherwise</li>
</ol></li>
<li>Systems not used for reporting but otherwise used internally ("Non-Reporting Systems", "Other Internal Systems")
<ol class="org-ol">
<li>May contain information that is non-reportable (such as internal and 3rd party communications), and</li>
<li>May contain information that does not represent the views or position of Fosshost or our directors or other volunteers, and</li>
<li>Officers or others requiring access (e.g. for example, officers named in this policy) that access shall be given as required, when
<ol class="org-ol">
<li>A given system is routinely referenced in Reporting Systems, or</li>
<li>Upon duly written request from any director, and otherwise</li>
</ol></li>
</ol></li>
<li>We grant access to systems, including where that access may include the ability to delete or review logs, when
<ol class="org-ol">
<li>A specific need exists for a person to access or routinely access a technology or system or systems, or</li>
<li>When our policy or legal or other requirement compels us to do so, however</li>
<li>We may at our digression follow other procedures, and</li>
<li>Such other procedures may be
<ol class="org-ol">
<li>given below, for example by reference, among our procedures, or otherwise by</li>
<li>exception, duly recorded as described above and elsewhere herein, and</li>
</ol></li>
</ol></li>
</ol></li>
<li>Logs of any kind which serve no purpose may be removed/deleted
<ol class="org-ol">
<li>at any time at our sole digression, however</li>
<li>we perform such deletion or removal by default automated means in most cases, or otherwise</li>
<li>such manual deletion of logs as we may order or detect may be recorded as a Planned Changed or Emergency Change, or is otherwise reported, thus</li>
</ol></li>
<li>Notwithstanding our officers and such rights and obligations as each may have (for example to inspect and otherwise audit Reporting Systems and those referenced),
<ol class="org-ol">
<li>Access to any of our systems is a privilege, and</li>
<li>May be revoked at any time, and</li>
<li>with or without cause or any reason stated, and</li>
<li>At our sole digression, but only given when</li>
<li>You consent to these and other terms.</li>
</ol></li>
<li>Reporting Systems shall not directly store, but may reference incorporate, information
<ol class="org-ol">
<li>Making or containing reference to a specific person not also referenced by that same name elsewhere in our policies and procedures, or</li>
<li>Including or referencing communication not intended to/for Fosshost or otherwise not clearly related to our acitivites, or</li>
<li>Making or containing reference to events not pertaining to the activities of Fosshost</li>
</ol></li>
<li>Non-Reporting Systems may and do store such information as may be required or convenient to and for our organization, however
<ol class="org-ol">
<li>We regularly inventory, audit, and otherwise account for all of our internal systems, and</li>
<li>Similarly, we do inventory, audit, and otherwise track access to all our internal systems,</li>
<li>And we do report and consider as vital records all such inventories and audits and their findings.</li>
</ol></li>
</ol>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orga3381a8" class="outline-3">
<h3 id="orga3381a8"><span class="section-number-3">2.3</span> ADMINISTRATIVE</h3>
<div class="outline-text-3" id="text-2-3">
<p>
We intend to document or otherwise describe nearly all of our internal procedures, while some details may be redacted and/or stored in more private repositories, we try to provide clear parameters around what we cannot publish, and to publish as much detail would be prudent and courteous and not more.
</p>

<p>
The items in this section describe tasks which are generally administrative but may include or reference other (e.g. more technical or more general) procedures elsewhere described in more detail.  Additionally, some details such as specific system names, symbolic links, keys, or other identifiers other than the names of people may be removed, replaced with placeholders, obscured, or otherwise concealed in those versions of our policies and procedures such as we make available publicly or otherwise than for our own (otherwise unrestrained) internal and necessary use.
</p>
</div>

<div id="outline-container-org4030593" class="outline-4">
<h4 id="org4030593"><span class="section-number-4">2.3.1</span> Keeping the Operations Log</h4>
</div>
<div id="outline-container-org1c5dc7d" class="outline-4">
<h4 id="org1c5dc7d"><span class="section-number-4">2.3.2</span> Basic Ticketing</h4>
</div>
<div id="outline-container-org6809199" class="outline-4">
<h4 id="org6809199"><span class="section-number-4">2.3.3</span> Requesting credentials</h4>
</div>
<div id="outline-container-org591586d" class="outline-4">
<h4 id="org591586d"><span class="section-number-4">2.3.4</span> Reviewing Applications</h4>
</div>
<div id="outline-container-org744b6cd" class="outline-4">
<h4 id="org744b6cd"><span class="section-number-4">2.3.5</span> On-boarding</h4>
<div class="outline-text-4" id="text-2-3-5">
</div>
<ol class="org-ol">
<li><a id="org0869269"></a>Facilities<br /></li>
<li><a id="orga812ec5"></a>Other (Sponsors and Vendors)<br /></li>
</ol>
</div>
<div id="outline-container-orgd001ad8" class="outline-4">
<h4 id="orgd001ad8"><span class="section-number-4">2.3.6</span> Updating the Asset Catalog</h4>
</div>
<div id="outline-container-org619472c" class="outline-4">
<h4 id="org619472c"><span class="section-number-4">2.3.7</span> Shipping and Receiving</h4>
</div>
<div id="outline-container-org26bb26b" class="outline-4">
<h4 id="org26bb26b"><span class="section-number-4">2.3.8</span> Special Handling for Reimbursable Receipts</h4>
</div>
<div id="outline-container-org5162854" class="outline-4">
<h4 id="org5162854"><span class="section-number-4">2.3.9</span> Accepting and Transferring Donations</h4>
</div>
<div id="outline-container-org6b64012" class="outline-4">
<h4 id="org6b64012"><span class="section-number-4">2.3.10</span> Running Meetings</h4>
</div>
</div>
<div id="outline-container-orgac52cb2" class="outline-3">
<h3 id="orgac52cb2"><span class="section-number-3">2.4</span> TECHNICAL</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgaf2ac3a" class="outline-4">
<h4 id="orgaf2ac3a"><span class="section-number-4">2.4.1</span> Testing Your Credentials</h4>
</div>
<div id="outline-container-org458bf0d" class="outline-4">
<h4 id="org458bf0d"><span class="section-number-4">2.4.2</span> AARCH64</h4>
<div class="outline-text-4" id="text-2-4-2">
</div>
<ol class="org-ol">
<li><a id="orgb2381c3"></a>AARCH64 Tenant Provisioning<br /></li>
<li><a id="orgdc9a124"></a>AARCH64 Creating Clusters<br /></li>
<li><a id="org60c2d30"></a>AARCH64 Adding and Removing Nodes<br /></li>
<li><a id="org35e7580"></a>AARCH64 Troubleshooting<br /></li>
</ol>
</div>
<div id="outline-container-orgd4d62bc" class="outline-4">
<h4 id="orgd4d62bc"><span class="section-number-4">2.4.3</span> General or x86 Specific</h4>
<div class="outline-text-4" id="text-2-4-3">
</div>
<ol class="org-ol">
<li><a id="orgac718c6"></a>Tenant Provisioning<br /></li>
<li><a id="orgbcc1c42"></a>Credentials<br />
<ol class="org-ol">
<li><a id="orgf82a458"></a>Provision Tenant Credential<br /></li>
<li><a id="orgd8c1b3c"></a>Provision Volunteer Credential<br /></li>
<li><a id="org366b087"></a>Removing Credentials<br /></li>
</ol>
</li>
<li><a id="orgbe504ec"></a>New or Changed or Replaced Nodes<br />
<ol class="org-ol">
<li><a id="org6f458fc"></a>Racking Hardware<br /></li>
<li><a id="org1154f05"></a>Provisioning Hypervisors<br /></li>
<li><a id="orgf16325f"></a>Restoring or Replicating a Node<br /></li>
<li><a id="org214e207"></a>Pooled Disc Replacement<br /></li>
<li><a id="orgdf99789"></a>Adding SSD<br /></li>
<li><a id="org288dbd8"></a>Troubleshooting Hardware Node Installation and Change<br /></li>
</ol>
</li>
<li><a id="orgb15bf3b"></a>Mirrors<br />
<ol class="org-ol">
<li><a id="org85b7583"></a>Add a mirror<br /></li>
<li><a id="orga321be6"></a>Remove a mirror<br /></li>
<li><a id="org3d28e62"></a>Mirrors Troubleshooting<br /></li>
</ol>
</li>
<li><a id="org2d11242"></a>Email and Web Hosting<br />
<ol class="org-ol">
<li><a id="org16cc770"></a>Provision a domain/project<br /></li>
<li><a id="org28fcdab"></a>Remove a domain/project<br /></li>
<li><a id="org916ec74"></a>Email and Web Troubleshooting<br /></li>
</ol>
</li>
<li><a id="org42971f2"></a>DNS<br />
<ol class="org-ol">
<li><a id="org96f7668"></a>Domain Registration<br /></li>
<li><a id="org32724e5"></a>Domain Renewal<br /></li>
<li><a id="org12bf8e9"></a>Reverse DNS<br /></li>
<li><a id="orge2bcc76"></a>DNS Troubleshooting<br /></li>
</ol>
</li>
</ol>
</div>
</div>
