README.org
*** Reporting Malfeasance and Abuse
*** Reporting Accounts Payable
*** Reporting Donations in Summary
*** Reporting Data Breach or Compromise
*** Reporting Termination of Service
*** Reporting Completed Changes in Summary
*** Reporting Proposed Changes to Policy and Procedure
*** Reporting Architecture and Design
*** Reporting Technology Changes
*** Reporting Outages
*** Reporting Applications Processed
*** Providing a Summary Report to the Board
*** Special Procedure for Board to Stand Generally In Recess

