README.html
<div id="outline-container-org3e4bbb5" class="outline-3">
<h3 id="org3e4bbb5"><span class="section-number-3">2.5</span> OVERSIGHT</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-orge034875" class="outline-4">
<h4 id="orge034875"><span class="section-number-4">2.5.1</span> Reporting Malfeasance and Abuse</h4>
</div>
<div id="outline-container-org93b1f6e" class="outline-4">
<h4 id="org93b1f6e"><span class="section-number-4">2.5.2</span> Reporting Accounts Payable</h4>
</div>
<div id="outline-container-org964ac6d" class="outline-4">
<h4 id="org964ac6d"><span class="section-number-4">2.5.3</span> Reporting Donations in Summary</h4>
</div>
<div id="outline-container-orgdf521c5" class="outline-4">
<h4 id="orgdf521c5"><span class="section-number-4">2.5.4</span> Reporting Data Breach or Compromise</h4>
</div>
<div id="outline-container-orgf8425d7" class="outline-4">
<h4 id="orgf8425d7"><span class="section-number-4">2.5.5</span> Reporting Termination of Service</h4>
</div>
<div id="outline-container-org90e1847" class="outline-4">
<h4 id="org90e1847"><span class="section-number-4">2.5.6</span> Reporting Completed Changes in Summary</h4>
</div>
<div id="outline-container-orgab11aea" class="outline-4">
<h4 id="orgab11aea"><span class="section-number-4">2.5.7</span> Reporting Proposed Changes to Policy and Procedure</h4>
</div>
<div id="outline-container-org88acc99" class="outline-4">
<h4 id="org88acc99"><span class="section-number-4">2.5.8</span> Reporting Architecture and Design</h4>
</div>
<div id="outline-container-orga49d1f1" class="outline-4">
<h4 id="orga49d1f1"><span class="section-number-4">2.5.9</span> Reporting Technology Changes</h4>
</div>
<div id="outline-container-org4bea239" class="outline-4">
<h4 id="org4bea239"><span class="section-number-4">2.5.10</span> Reporting Outages</h4>
</div>
<div id="outline-container-org13c7c39" class="outline-4">
<h4 id="org13c7c39"><span class="section-number-4">2.5.11</span> Reporting Applications Processed</h4>
</div>
<div id="outline-container-orga750df1" class="outline-4">
<h4 id="orga750df1"><span class="section-number-4">2.5.12</span> Providing a Summary Report to the Board</h4>
</div>
<div id="outline-container-org6003b09" class="outline-4">
<h4 id="org6003b09"><span class="section-number-4">2.5.13</span> Special Procedure for Board to Stand Generally In Recess</h4>
</div>
</div>
</div>
