README.org
* INCOMPLETE AND OTHER

scraps, extended notes, references, and clarifications

items may each include, or may by specific reference to other items, include summary, general, technical, and proposed or authoritative descriptions including such delegations as we have agree to make and specifically agree to. Considering this document as including by reference all duly referenced documents and other information, and given access to all sources of such information as may be necessary to fully and completely perform in good faith any and all audits, retention of records, or other specific duties any director or some other volunteers is or may be entitled or obligated to perform, this and no other document or sources except those as we may duly reference or make regular and known exception to reference related to, and not any other document or other contract or device controls or otherwise compels our organization or it's members/representatives, who seek at all times to act in the public good to create and demonstrate benefit to our community.

NOTE: Sections may include by reference additional language and descriptions that narrow or further specify and clarify some or all of our practices, and may include references which aren't and may never become public.  Such are generally considered in terms of known exceptions to our transparency policy and documented as such, however they are in all cases specifically and, even if when by explicit reference to a private or other protected system may have been redacted, otherwise complete and true as for someone with full and complete access to the set of records including those referenced as a single set of information taken at a specific point in time.

Otherwise, no allowance for any change to the above or other below information (e.g. beside narrowing and adding of specificity, etc. updates for currency, and other maintenance as may have been or already be defined or allowed for) is changed nor is intended to be changed in or by ITEMS below except that the ITEMS below are intended to be simpler in nature, potentially each describing a simple (however technical) sequence of steps, and for the express purpose of simplifying such as may be below, the maintenance thereof, and enabling the swift and appropriate delegation of effective authority within our organization to effect changed based upon our agreed to processes, including those

     And where helpful in clarifying and otherwise understanding, as to accept or otherwise if and when they may be effective, some policy or procedure described whether outlined or in detail by this procedure, or by inclusion herein recognized (for example, for later inclusion by reference) such as standard and regular exceptions to our usual process, such as we duly record and may hereby acknowledge, however, and otherwise, each procedure or other regular and routine construction to satisfy our obligations, for example under our articles or policies, which document or otherwise reference its own accounts of such exceptions.

 such as to make a specific and limited scope of authority( or meaning to reference as to fully describe the actual or intended practice and provide and the most full and accurate description available as to its complete meaning and necessary effects on our organization and otherwise to provide and/or provide by reference the complete work.  Unless as may be noted in our articles or otherwise above

From time to time, such as for information we deem to be for internal use only, certain specific systems and/or information or mechinisims for interacting with these systems or information may be described in significant part elsewhere and used to limit such reference, information may be stored or managed by procedure  or referenced cannot be published  referenced more directly here.   Where, and to the extent available detailed technical as well as human oriented information may be included or referenced.  In some cases, restricted or other internal use information may be directly or otherwise significantly cause risk or injury to Fosshost, or our tenants, supporters, etc. community should they exposed, expressed, described, or more directly referenced herein, in which case the below ITEMS may provide reference and constraint and thereafter permit our of some or several internal use system or record or other information, when and only when, if not constrained by such and/or similar restrictions if expressed most simply and directly herein, wherefore ITEMS below may, express and/or including by description and reference any and all obligations, restrictions placed on Fosshost or by Fosshost on others whether directly as a result of our intended activities as may be and are authorized under this complete work, taken together and considering it with all referenced or otherwise explicitly incorporated works general as all any full and complete as technical and specific authorities for some or all of those empowered or otherwise guided by our organization, such as while volunteering for or receiving service from Fosshost.

Notwithstanding this SUMMARY and below NOTE, which other than this sense may be by procdure, including the nature, meaning, and effect of the below NOTE

in terms of both general and, where possible and completed, specific and technically accurate and complete documentation of our methods and approaches. In so far as we have governing internally maintained documentation or have otherwise provided any framework to create or use or otherwise use information other than our own best judgment including our full and complete knowledge and belief, that documentation, or reference and outline for that documentation including, where available such as eventually by following of documented and consistently available   for them, have agreed to do so, and/or whereas we are working toward those goals.

For each sub-section, a write a new procedure trying to including as much as possible of/from
 * a specific practice, why and how to do it, and how that is working out for us, including
   * a clear description of the procedure in terms of how complete it is,
     * Design - it has been added to this document and not otherwise removed subsequent to any other article or procedure.
     * Adoption - it has been sponsored or forwarded by rule for further consideration up to and including a specific date and time when it shall become effective
     * Implementation - it is our effective and binding policy now and we may report on our compliance with it
     * Satisfaction - in any cases where not otherwise removed subsequent to other article or procedure, feedback is welcome.
   * for new things, the specific path or course of action proscribed, who's affected, their feelings and concerns
   * discussing/raising known and routine exceptions to other policy, if any
   * a description of how this may or should influence our network and services, and
   * any accepted understanding or theory you may have as to how our partners such as tenants or sponsors are, would be, or may be affected, and
 * include complete step-by-step technical and specific means to follow each step, whatever possible focusing first on
   * end-users (who may be trying to learn new things volunteering with us)
   * or developers (who may be trying to get something we need working)
   * And generally focusing on human facing detail (so that people can understand what we are doing, how we are doing it, and why).
 * and without fear of judgment or reprisal
   * provide only much of these as you are reasonably able. e.g., with a give commit/PR/hunk-of-your-time/etc.
   * frankly set forth alternatives in terms of and/or contrasted with our stated and aligned objectives
   * and at your own level of skill/language proficiency/etc. as best your are able and have time
 * and may create or establish roles
   * in the from of such and specific person or persons with our organization and including our partners and community, and
   * given and by generally mutual acknowledgement and consent, or
   * by specific delegation by policy or procedure, and in either case
   * when and as the directors shall agree and the secretary so record.


  And whereas these are for our internal and external practices. specifically:
  * defining a general practice for decision making including information categorization
  * listing the categories of information we recognize
  * describing the purpose and intent of procedures specifically established by our policy for handling information
  * describing how we create and maintenance procedures considering the information sensitivity and other factors

  Some too portion of the complete set represented by all policies and
  procedures may secret, in that to some degree or in some parts they
  may be internal-use only.  For example for example, certain source
  code, branches, ticketing notes or other documentation may contain
  such information or by reference or inference touch upon privacy
  controls or specifically controlled information as we may retain
  and/or use for internal or other purposes as elsewhere in our
  policies and procedures specifically specified, wherefore items
  included herein and by reference, even as may be as specifically
  made internal-use or otherwise classified not for
  distributor/publication, e.g. to the public, are not to be
  distributed otherwise and expect and documented specifically herein
  and above, and within confine and by these extensions this is our
  full and complete reference in our policy and procedure, including
  for example such details in terms any or all a known exceptions, or
  and reported on as so described herein as such, with the provision
  that no further act lower in this policy or procedural guidance
  above the prior items is to be construed as relinquishing the
  authorities or responsibility defined under our articles or above as
  items of our policy, though they may delegated as a matter of course
  where well demonstrably established as routine and regular and duly
  reported as may regard within this single document including such
  private references as it may to be considered complete require.

 NOTE: this concludes our policies, refer to the information above for
 any completed or other procedure and/or policies and procedural
 language work-in-process, documentation and references regarding FOSS
 products and services we directly or by extension provide along with
 their licenses and any unique guidance or perspective we may have
 regarding our use, and such else as we may include or allow to be
 included and generally to demonstrate or effect or otherwise progress
 toward that herein and/or as duly referenced, and whereas we may (as
 prudent and courteously, publicly) provide for a transparent reliable
 alternative for FOSS projects, attending to their regular and
 necessary internet services and for such hosting needs without
 charging them or anyone specifically for any given services, and this
 including all of the above and below including those public external
 or private internal and secret forms referenced herein. and together
 these with our articles as filed with the office of the UK CIC
 regulator form or as may be ammended and duly recorded herein while
 our articles are being reflied or updated or otherwise consistude by
 or for this or a similar authority, and when taken together all of
 these for our complete and sole policy and/or procedure, and
 otherwise no document or contract controls the actions of our
 directors or other volunteers without it is expressly and duly
 provided for and reported herein.
